# Host: localhost  (Version: 5.5.15)
# Date: 2017-12-30 15:54:25

# Generator: MySQL-Front 5.3  (Build 4.269)

/*!40101 SET NAMES gb2312 */;

#
# Structure for table "chapter"
#

DROP TABLE IF EXISTS `chapter`;
CREATE TABLE `chapter` (
  `id` varchar(64) NOT NULL,
  `number` varchar(9) NOT NULL,
  `name` varchar(40) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "chapter"
#

INSERT INTO `chapter` VALUES ('b7ffaff214854796badc6ddb0f43c6c0','testsss','testsss','2017-12-13 21:47:04','2017-12-13 21:47:04',0),('c754937d17dd4beab5a07cdd85874d63','string','zzzzzzzzzzzzz','2017-12-05 21:36:45','2017-12-06 08:42:22',0),('ce5952e1b48144c0b41f8255b4ca9a93','strddddd','stringddddddddd','2017-12-05 20:54:36','2017-12-13 22:01:02',0);

#
# Structure for table "chapter_comment"
#

DROP TABLE IF EXISTS `chapter_comment`;
CREATE TABLE `chapter_comment` (
  `chapter_id` varchar(33) NOT NULL,
  `comment_id` bigint(20) NOT NULL,
  `is_delete` tinyint(4) DEFAULT '0',
  PRIMARY KEY (`chapter_id`,`comment_id`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

#
# Data for table "chapter_comment"
#


#
# Structure for table "chapter_exercise"
#

DROP TABLE IF EXISTS `chapter_exercise`;
CREATE TABLE `chapter_exercise` (
  `chapter_id` varchar(64) NOT NULL,
  `exercise_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`chapter_id`,`exercise_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "chapter_exercise"
#


#
# Structure for table "chapter_homework"
#

DROP TABLE IF EXISTS `chapter_homework`;
CREATE TABLE `chapter_homework` (
  `chapter_id` varchar(64) NOT NULL,
  `homework_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`chapter_id`,`homework_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "chapter_homework"
#


#
# Structure for table "chapter_unit"
#

DROP TABLE IF EXISTS `chapter_unit`;
CREATE TABLE `chapter_unit` (
  `chapter_id` varchar(64) NOT NULL,
  `unit_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`chapter_id`,`unit_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "chapter_unit"
#

INSERT INTO `chapter_unit` VALUES ('b7ffaff214854796badc6ddb0f43c6c0','bcbfe8d211f24a7ca64636a34443f613','2017-12-13 22:47:33','2017-12-13 22:47:33',0),('b7ffaff214854796badc6ddb0f43c6c0','e5637d3f0f9f4804bfdd0741a3b51451','2017-12-17 19:39:45','2017-12-17 19:39:45',1);

#
# Structure for table "comment"
#

DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment` (
  `id` bigint(20) NOT NULL,
  `content` text NOT NULL,
  `chapter_id` varchar(33) NOT NULL,
  `agree_count` int(11) NOT NULL DEFAULT '0',
  `is_check` tinyint(4) NOT NULL DEFAULT '0',
  `is_pass` tinyint(4) NOT NULL DEFAULT '0',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `is_delete` smallint(6) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

#
# Data for table "comment"
#


#
# Structure for table "course"
#

DROP TABLE IF EXISTS `course`;
CREATE TABLE `course` (
  `id` varchar(64) NOT NULL,
  `number` varchar(20) NOT NULL,
  `name` varchar(40) DEFAULT NULL,
  `type` varchar(20) NOT NULL,
  `introduction` text,
  `credit` varchar(10) DEFAULT NULL,
  `hours` varchar(10) DEFAULT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "course"
#

<<<<<<< HEAD
INSERT INTO `course` VALUES ('02acad2b6d7f468da1435055a2b72443','A28','商业研究方法','辅助课程','','1','1','2017-12-24 20:43:18','2017-12-24 20:43:18',0),('0a497b0c5ae443869938232979b03e9f','A35','毕业论文/设计','辅助课程','','1','1','2017-12-24 20:46:48','2017-12-24 20:46:48',0),('1','ascas','cas','sdav','dvs','sadv','vv','2017-12-06 19:19:00','2017-12-07 11:26:36',1),('17bfbbcd244b4f5b9a15df2b43ce87b9','A19','JAVA高级应用（课程设计）','辅助课程','','1','1','2017-12-24 20:38:20','2017-12-24 20:38:20',0),('1a80be5c25a641529d4f439546c0700f','A21','Python','辅助课程','','1','1','2017-12-24 20:39:27','2017-12-24 20:39:27',0),('1ba8f61a23d64e6e939552e39602b06b','B12','大学物理实验','辅助课程','','1','1','2017-12-24 20:22:39','2017-12-24 20:22:39',0),('1e1cb4677feb488c86ba9e1b618a6357','B02','英语','辅助课程','','1','1','2017-12-24 20:16:56','2017-12-24 20:16:56',0),('223a742b176b4aa68dba50c49b81dd84','zdfb','zdfbzdf','zfdb','zz','zfb',NULL,'2017-12-06 19:22:05','2017-12-06 19:22:05',0),('2c6e1f38838a4e74b2a742e968867c82','A06','经济学','辅助课程','','1','1','2017-12-24 20:28:13','2017-12-24 20:28:13',0),('2d097c854e5849648d7f9285ca72e602','A18','数据库原理与应用','辅助课程','','1','1','2017-12-24 20:37:17','2017-12-24 20:37:17',0),('3067bec0fae449b4b475ffacd86aeb3c','A08','供应链与物流管理','核心课程','','1','1','2017-12-24 20:31:20','2017-12-24 20:31:20',0),('38381e9deba64eb5b8803df07b5a756c','A17','计算机科学与基础','辅助课程','','1','1','2017-12-24 20:36:29','2017-12-24 20:36:29',0),('4486c2dc6da44bf3ab4ca450ab22f50b','B11','大学物理C','辅助课程','','1','1','2017-12-24 20:22:13','2017-12-24 20:22:13',0),('458d0ee25a6f4c76ba7c66cb6f9fb684','A04','电子商务案例分析','辅助课程','','1','1','2017-12-24 20:27:04','2017-12-24 20:27:04',0),('47a4c912bd774054afc9116490af7cf8','A01','电子商务概论','核心课程','','1','1','2017-12-24 20:24:52','2017-12-24 20:24:52',0),('54e03bc9e2d24f90aabd13bd8d6d11dd','A13','信息系统分析与设计','核心课程','','1','1','2017-12-24 20:34:47','2017-12-24 20:34:47',0),('55bb7cb3be5b44349675090f61cc56e5','A24','商务智能与大数据分析','核心课程','','1','1','2017-12-24 20:41:00','2017-12-24 20:41:00',0),('566e51f81efe40a2961dcbbeb31d85cf','B07','思想道德修养与法律基础','辅助课程','','1','1','2017-12-24 20:20:18','2017-12-24 20:20:18',0),('56d754b9edcc47dc9c98a1a49ebf9745','A11','电子商务服务','辅助课程','','1','1','2017-12-24 20:33:30','2017-12-24 20:33:30',0),('5dbcdabac52d4a968f791a99842c3310','B06','中国近代史纲要','辅助课程','','1','1','2017-12-24 20:19:38','2017-12-24 20:19:38',0),('63b9db88035b4433b23979dec9cde6a6','A26','离散数学','辅助课程','','1','1','2017-12-24 20:42:12','2017-12-24 20:42:12',0),('63be3c4a046b4156a4ab68c58331ad46','B10','高等数学A','辅助课程','','1','1','2017-12-24 20:21:52','2017-12-24 20:21:52',0),('68be5e7ee8d64caca1727c4b00a67b9a','A12','社会化营销','预备课程','','1','1','2017-12-24 20:33:57','2017-12-24 20:33:57',0),('68f5f3cf5f1341469b54a97c7693e9bc','A09','网络交易','辅助课程','','1','1','2017-12-24 20:31:56','2017-12-24 20:31:56',0),('6d6d1186c4494c7a93914b3754c1eaac','B14','概率论与数理统计','辅助课程','','1','1','2017-12-24 20:23:36','2017-12-24 20:23:36',0),('74615fae2f434219abf8753797f77a94','A36','创业管理','辅助课程','','1','1','2017-12-24 20:47:12','2017-12-24 20:47:12',0),('7b72db9416c640f6b61305cc6c4b772e','A34','电子商务发展专题','辅助课程','','1','1','2017-12-24 20:46:03','2017-12-24 20:46:03',0),('80450753b02445eda613ebcfae9cfaa5','A23','管理统计学','核心磕碜','','1','1','2017-12-24 20:40:35','2017-12-24 20:40:35',0),('805396da52b3420293cae4845a0c7236','B04','毛泽东思想与中国特色社会主义理论','辅助课程','','1','1','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('8e2abff457c84db8b4b71b44e2373a79','A07','电子商务专业英语','辅助课程','','1','1','2017-12-24 20:29:01','2017-12-24 20:29:01',0),('925a54e418d240ce8c309c19df4616d6','B03','大学体育','辅助课程','','1','1','2017-12-24 20:17:28','2017-12-24 20:17:28',0),('937a1b99a70e4bd9adcdafc2a87e38c9','A02','企业管理学','辅助课程','','1','1','2017-12-24 20:25:31','2017-12-24 20:25:31',0),('96fb9435f15642328520cad703e32e67','A05','经济法','辅助课程','','1','1','2017-12-24 20:27:41','2017-12-24 20:27:41',0),('96ffabbebc3f4ec8aeeb66f3f4f39d24','A27','管理决策分析','辅助课程','','1','1','2017-12-24 20:42:42','2017-12-24 20:42:42',0),('9be614b2aaeb41579810c4ada43988ad','B01','形势与政策','辅助课程','','0.3','3','2017-12-24 20:16:20','2017-12-24 20:16:20',0),('a07274e3e90c446ea5e464df040d9c46','45','45','4','44','5',NULL,'2017-12-06 19:17:11','2017-12-06 19:17:11',1),('a5cebe6309904802b4ed65b6bba5a985','A07','网络营销','核心课程','','1','1','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('a76d96680af840818cef65ec9b1f5893','A18','JAVA程序设计（课程设计）','辅助课程','','1','1','2017-12-24 20:37:54','2017-12-24 20:37:54',0),('a8e4f84fa7044d219675f4ccc9f5c7c3','B08','军事理论','辅助课程','','1','1','2017-12-24 20:20:42','2017-12-24 20:20:42',0),('abd953040f24406493c5229abc67ed79','A15','移动开发技术','核心课程','','1','1','2017-12-24 20:35:12','2017-12-24 20:35:12',0),('ac03ee1529e34586b2b34f0a37e1f224','A25','人工智能','预备课程','','1','1','2017-12-24 20:41:39','2017-12-24 20:41:39',0),('ada5cddcb5764768bba89a1e9f49850d','B09','大学生心理健康','辅助课程','','1','1','2017-12-24 20:21:20','2017-12-24 20:21:20',0),('bee646f3d731496bb9a67e7684294670','A29','管理信息学','辅助课程','','1','1','2017-12-24 20:43:46','2017-12-24 20:43:46',0),('c1722db650f54ac68029b4341281e755','A10','客户关系管理','辅助课程','','1','1','2017-12-24 20:32:20','2017-12-24 20:32:20',0),('c22dc588c4e642e28b4fbf0e5266584e','A33','电子商务综合实践实训','核心课程','','1','1','2017-12-24 20:45:27','2017-12-24 20:45:27',0),('c4a70eeea2b94004a4d0440a3e137ebd','B13','线性代数','辅助课程','','1','1','2017-12-24 20:23:04','2017-12-24 20:23:04',0),('c4a7b01ded644212bce6e8c39963a4f0','A31','个性化推荐','yu预备课程','','1','1','2017-12-24 20:44:51','2017-12-24 20:44:51',0),('c6f694ee59fb4b08aac806682beaf36d','A37','创新创业教育','辅助课程','','1','1','2017-12-24 20:47:36','2017-12-24 20:47:36',0),('d28d0d16aef24cadb666a35eb5c74f3d','A08','网络金融与支付','核心课程','','1','1','2017-12-24 20:30:37','2017-12-24 20:30:37',0),('d6d267c4fff7433f974c6898f653afc6','A10','电子商务安全','辅助课程','','1','1','2017-12-24 20:32:52','2017-12-24 20:32:52',0),('d703a9696bae4fd394647a6e50da3022','string','string','test','string','2','fb','2017-11-30 14:29:14','2017-12-07 14:45:54',0),('d9441495006543b28ef50163f11e5913','B15','工程图学C','辅助课程','','1','1','2017-12-24 20:24:08','2017-12-24 20:24:08',0),('dc9d54e7057c4be597feed6a66b2b729','54','e5','5','ds','5',NULL,'2017-12-06 19:18:12','2017-12-06 19:18:12',0),('de419d0bd25743f0b19ae5a97ecb45e5','B05','马克思主义基本原理概论','辅助课程','','1','1','2017-12-24 20:18:54','2017-12-24 20:18:54',0),('dfd1575c3b634d0cbf91f06658e1084d','A03','电子商务专业导论','辅助课程','','1','1','2017-12-24 20:26:29','2017-12-24 20:26:29',0),('dfd8c01f7edc4bf8873d688396552e12','A22','运筹学','核心课程','','1','1','2017-12-24 20:40:08','2017-12-24 20:40:08',0),('ed7de5d5525a437e9b234b1934f8ed89','A30','计量经济学','辅助课程','','1','1','2017-12-24 20:44:10','2017-12-24 20:44:10',0),('f35a95424907463f93c9cecd6afec2a3','A20','UML及其建模工具','辅助课程','','1','1','2017-12-24 20:39:00','2017-12-24 20:39:00',0),('f5f82afd1f3d421d818f5fae9ba07b68','A16','程序设计语言','辅助课程','','1','1','2017-12-24 20:35:40','2017-12-24 20:35:40',0),('f905c98b75824c61814002e44c1ed75b','4454','4','5','sacascas','45',NULL,'2017-12-06 19:10:19','2017-12-06 19:10:19',0);
=======
INSERT INTO `course` VALUES ('02acad2b6d7f468da1435055a2b72443','A28','商业研究方法','辅助课程','','1','1','2017-12-24 20:43:18','2017-12-24 20:43:18',0),('0a497b0c5ae443869938232979b03e9f','A35','毕业论文/设计','辅助课程','','1','1','2017-12-24 20:46:48','2017-12-24 20:46:48',0),('1','1','1','1','1','1','1','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('17bfbbcd244b4f5b9a15df2b43ce87b9','A19','JAVA高级应用（课程设计）','辅助课程','','1','1','2017-12-24 20:38:20','2017-12-24 20:38:20',0),('1a80be5c25a641529d4f439546c0700f','A21','Python','辅助课程','','1','1','2017-12-24 20:39:27','2017-12-24 20:39:27',0),('1ba8f61a23d64e6e939552e39602b06b','B12','大学物理实验','辅助课程','','1','1','2017-12-24 20:22:39','2017-12-24 20:22:39',0),('1e1cb4677feb488c86ba9e1b618a6357','B02','英语','辅助课程','','1','1','2017-12-24 20:16:56','2017-12-24 20:16:56',0),('2c6e1f38838a4e74b2a742e968867c82','A06','经济学','辅助课程','','1','1','2017-12-24 20:28:13','2017-12-24 20:28:13',0),('2d097c854e5849648d7f9285ca72e602','A18','数据库原理与应用','辅助课程','','1','1','2017-12-24 20:37:17','2017-12-24 20:37:17',0),('3067bec0fae449b4b475ffacd86aeb3c','A08','供应链与物流管理','核心课程','','1','1','2017-12-24 20:31:20','2017-12-24 20:31:20',0),('38381e9deba64eb5b8803df07b5a756c','A17','计算机科学与基础','辅助课程','','1','1','2017-12-24 20:36:29','2017-12-24 20:36:29',0),('4486c2dc6da44bf3ab4ca450ab22f50b','B11','大学物理C','辅助课程','','1','1','2017-12-24 20:22:13','2017-12-24 20:22:13',0),('458d0ee25a6f4c76ba7c66cb6f9fb684','A04','电子商务案例分析','辅助课程','','1','1','2017-12-24 20:27:04','2017-12-24 20:27:04',0),('47a4c912bd774054afc9116490af7cf8','A01','电子商务概论','核心课程','','1','1','2017-12-24 20:24:52','2017-12-24 20:24:52',0),('54e03bc9e2d24f90aabd13bd8d6d11dd','A13','信息系统分析与设计','核心课程','','1','1','2017-12-24 20:34:47','2017-12-24 20:34:47',0),('55bb7cb3be5b44349675090f61cc56e5','A24','商务智能与大数据分析','核心课程','','1','1','2017-12-24 20:41:00','2017-12-24 20:41:00',0),('566e51f81efe40a2961dcbbeb31d85cf','B07','思想道德修养与法律基础','辅助课程','','1','1','2017-12-24 20:20:18','2017-12-24 20:20:18',0),('56d754b9edcc47dc9c98a1a49ebf9745','A11','电子商务服务','辅助课程','','1','1','2017-12-24 20:33:30','2017-12-24 20:33:30',0),('5dbcdabac52d4a968f791a99842c3310','B06','中国近代史纲要','辅助课程','','1','1','2017-12-24 20:19:38','2017-12-24 20:19:38',0),('63b9db88035b4433b23979dec9cde6a6','A26','离散数学','辅助课程','','1','1','2017-12-24 20:42:12','2017-12-24 20:42:12',0),('63be3c4a046b4156a4ab68c58331ad46','B10','高等数学A','辅助课程','','1','1','2017-12-24 20:21:52','2017-12-24 20:21:52',0),('68be5e7ee8d64caca1727c4b00a67b9a','A12','社会化营销','预备课程','','1','1','2017-12-24 20:33:57','2017-12-24 20:33:57',0),('68f5f3cf5f1341469b54a97c7693e9bc','A09','网络交易','辅助课程','','1','1','2017-12-24 20:31:56','2017-12-24 20:31:56',0),('6d6d1186c4494c7a93914b3754c1eaac','B14','概率论与数理统计','辅助课程','','1','1','2017-12-24 20:23:36','2017-12-24 20:23:36',0),('74615fae2f434219abf8753797f77a94','A36','创业管理','辅助课程','','1','1','2017-12-24 20:47:12','2017-12-24 20:47:12',0),('7b72db9416c640f6b61305cc6c4b772e','A34','电子商务发展专题','辅助课程','','1','1','2017-12-24 20:46:03','2017-12-24 20:46:03',0),('8','string44','string444','string444','string','stri44ng','strin44g','2017-12-26 23:04:52','2017-12-28 18:02:22',1),('80450753b02445eda613ebcfae9cfaa5','A23','管理统计学','核心磕碜','','1','1','2017-12-24 20:40:35','2017-12-24 20:40:35',0),('805396da52b3420293cae4845a0c7236','B04','毛泽东思想与中国特色社会主义理论','辅助课程','','1','1','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('8e2abff457c84db8b4b71b44e2373a79','A07','电子商务专业英语','辅助课程','','1','1','2017-12-24 20:29:01','2017-12-24 20:29:01',0),('925a54e418d240ce8c309c19df4616d6','B03','大学体育','辅助课程','','1','1','2017-12-24 20:17:28','2017-12-24 20:17:28',0),('937a1b99a70e4bd9adcdafc2a87e38c9','A02','企业管理学','辅助课程','','1','1','2017-12-24 20:25:31','2017-12-24 20:25:31',0),('96fb9435f15642328520cad703e32e67','A05','经济法','辅助课程','','1','1','2017-12-24 20:27:41','2017-12-24 20:27:41',0),('96ffabbebc3f4ec8aeeb66f3f4f39d24','A27','管理决策分析','辅助课程','','1','1','2017-12-24 20:42:42','2017-12-24 20:42:42',0),('9be614b2aaeb41579810c4ada43988ad','B01','形势与政策','辅助课程','','0.3','3','2017-12-24 20:16:20','2017-12-24 20:16:20',0),('a5cebe6309904802b4ed65b6bba5a985','A07','网络营销','核心课程','','1','1','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('a76d96680af840818cef65ec9b1f5893','A18','JAVA程序设计（课程设计）','辅助课程','','1','1','2017-12-24 20:37:54','2017-12-24 20:37:54',0),('a8e4f84fa7044d219675f4ccc9f5c7c3','B08','军事理论','辅助课程','','1','1','2017-12-24 20:20:42','2017-12-24 20:20:42',0),('abd953040f24406493c5229abc67ed79','A15','移动开发技术','核心课程','','1','1','2017-12-24 20:35:12','2017-12-24 20:35:12',0),('ac03ee1529e34586b2b34f0a37e1f224','A25','人工智能','预备课程','','1','1','2017-12-24 20:41:39','2017-12-24 20:41:39',0),('ada5cddcb5764768bba89a1e9f49850d','B09','大学生心理健康','辅助课程','','1','1','2017-12-24 20:21:20','2017-12-24 20:21:20',0),('bee646f3d731496bb9a67e7684294670','A29','管理信息学','辅助课程','','1','1','2017-12-24 20:43:46','2017-12-24 20:43:46',0),('c1722db650f54ac68029b4341281e755','A10','客户关系管理','辅助课程','','1','1','2017-12-24 20:32:20','2017-12-24 20:32:20',0),('c22dc588c4e642e28b4fbf0e5266584e','A33','电子商务综合实践实训','核心课程','','1','1','2017-12-24 20:45:27','2017-12-24 20:45:27',0),('c4a70eeea2b94004a4d0440a3e137ebd','B13','线性代数','辅助课程','','1','1','2017-12-24 20:23:04','2017-12-24 20:23:04',0),('c4a7b01ded644212bce6e8c39963a4f0','A31','个性化推荐','yu预备课程','','1','1','2017-12-24 20:44:51','2017-12-24 20:44:51',0),('c6f694ee59fb4b08aac806682beaf36d','A37','创新创业教育','辅助课程','','1','1','2017-12-24 20:47:36','2017-12-24 20:47:36',0),('d28d0d16aef24cadb666a35eb5c74f3d','A08','网络金融与支付','核心课程','','1','1','2017-12-24 20:30:37','2017-12-24 20:30:37',0),('d6d267c4fff7433f974c6898f653afc6','A10','电子商务安全','辅助课程','','1','1','2017-12-24 20:32:52','2017-12-24 20:32:52',0),('d9441495006543b28ef50163f11e5913','B15','工程图学C','辅助课程','','1','1','2017-12-24 20:24:08','2017-12-24 20:24:08',0),('de419d0bd25743f0b19ae5a97ecb45e5','B05','马克思主义基本原理概论','辅助课程','','1','1','2017-12-24 20:18:54','2017-12-24 20:18:54',0),('dfd1575c3b634d0cbf91f06658e1084d','A03','电子商务专业导论','辅助课程','','1','1','2017-12-24 20:26:29','2017-12-24 20:26:29',0),('dfd8c01f7edc4bf8873d688396552e12','A22','运筹学','核心课程','','1','1','2017-12-24 20:40:08','2017-12-24 20:40:08',0),('ed7de5d5525a437e9b234b1934f8ed89','A30','计量经济学','辅助课程','','1','1','2017-12-24 20:44:10','2017-12-24 20:44:10',0),('f35a95424907463f93c9cecd6afec2a3','A20','UML及其建模工具','辅助课程','','1','1','2017-12-24 20:39:00','2017-12-24 20:39:00',0),('f5f82afd1f3d421d818f5fae9ba07b68','A16','程序设计语言','辅助课程','','1','1','2017-12-24 20:35:40','2017-12-24 20:35:40',0);
>>>>>>> seperate

#
# Structure for table "course_chapter"
#

DROP TABLE IF EXISTS `course_chapter`;
CREATE TABLE `course_chapter` (
  `course_id` varchar(64) NOT NULL,
  `chapter_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`course_id`,`chapter_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "course_chapter"
#

INSERT INTO `course_chapter` VALUES ('223a742b176b4aa68dba50c49b81dd84','b7ffaff214854796badc6ddb0f43c6c0','2017-12-13 21:47:04','2017-12-13 21:47:04',0);

#
# Structure for table "course_inform"
#

DROP TABLE IF EXISTS `course_inform`;
CREATE TABLE `course_inform` (
  `course_id` varchar(64) NOT NULL,
  `inform_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`course_id`,`inform_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "course_inform"
#


#
# Structure for table "course_picture"
#

DROP TABLE IF EXISTS `course_picture`;
CREATE TABLE `course_picture` (
  `course_id` varchar(64) NOT NULL,
  `picture_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`course_id`,`picture_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "course_picture"
#

INSERT INTO `course_picture` VALUES ('2cbcb37a98f94e90b604288e45f5ed32','1','2017-12-26 20:35:54','2017-12-26 20:35:54',0),('b40d0b00798f48a29c6cdf0da979703c','1','2017-12-26 20:43:43','2017-12-26 20:43:43',0);

#
# Structure for table "coursegroup"
#

DROP TABLE IF EXISTS `coursegroup`;
CREATE TABLE `coursegroup` (
  `id` varchar(64) NOT NULL,
  `number` varchar(20) NOT NULL,
  `name` varchar(40) NOT NULL,
  `introduction` text,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "coursegroup"
#

<<<<<<< HEAD
INSERT INTO `coursegroup` VALUES ('0533e4b170d9437b952407e370b1fdc6','2231','3212','31231','2017-12-06 15:03:56','2017-12-06 15:03:56',0),('151f129a458244ae8351cae8647b9b30','stuuuuridddddddng','sjjjtrindddg','sxxxdddddddx','2017-12-06 14:30:56','2017-12-06 14:30:56',0),('2aac25c733a347edad60e7e1fcc8b25d','B02','数理基础类课程组','该课程组主要包含以下课程：  高等数学A、大学物理C、大学物理实验、线性代数、概率论与数理统计、工程图学C。','2017-12-24 19:49:27','2017-12-24 19:55:29',0),('35e8a660a06640f4aa3f3043176e5418','string','bbbbbbbbbbbbbbb','ccccccccccccc','2017-11-29 10:59:36','2017-11-29 11:00:46',0),('3c23544462724655a43f32b2969a3b3b','A04','电商系统设计与开发课程组','该课程组主要包含以下课程组：\n  核心课程：信息系统分析与设计、移动开发技术 \n  辅助课程：程序设计语言、计算机科学基础、数据库原理与应用、JAVA程序设计（课程设计）、JAVA高级应用（课程设计）、UML及其建模工\n  具、Python*\n  课程组成员：倪志伟（组长）、伍章俊（协助）、刘林、程浩、倪丽萍、余本功、张强','2017-12-24 19:52:19','2017-12-24 19:52:19',0),('57d4167b2d0a4d708c2f6a18db1f49a6','A06','创新创业课程组','该课程组主要包含以下课程：\n   核心课程：电子商务综合实践实训\n   辅助课程：电子商务发展专题、毕业论文/设计、创业管理、创新创业教育\n   课程组成员：姜元春（组长）、李应（协助）、赵菊、李锋刚、程八一','2017-12-24 19:54:19','2017-12-24 19:54:19',0),('591f1d1280994bc39ae815725d543aee','1234567890','ggggggggggggggggggggggggggg','gggggggggggggggggggggggggggg','2017-12-06 14:57:13','2017-12-06 14:57:13',0),('64c0fbe7e7244a738ea3a84d9933b5b2','A05','商务数据建模与分析课程组','该课程组主要包含以下课程：\n  \t核心课程：运筹学、管理统计学、商务智能与大数据分析、人工智能*\n        辅助课程：离散数学、管理决策分析、商业研究方法、管理信息学、计量经济学、个性化推荐*\n        课程组成员：刘心报（组长）、姜元春（协助）、裴军（协助）、孙见山、江兵、方必和、周谧、裴凤、陈夏雨、王刚、许启发、孙春华','2017-12-24 19:53:18','2017-12-24 19:53:18',0),('68e5fd59723c455093b3a9dbcdcdf914','A02','电子商务基础课程组','该课程组主要包含以下课程：\n  核心课程：电子商务概论\n  辅助课程：企业管理学、电子商务专业导论、电子商务案例分析、经济法（含电子商务法）、经济学、电子商务专业英语\n  课程组成员：刘业政（组长）、倪丽萍（协助）、电子商务系全体老师及学院平台课老师','2017-12-24 19:50:23','2017-12-24 19:50:23',0),('764e0bb0a6004a49b2832f8ee8181731','A03','电商运营与服务课程组','该课程组主要包含以下课程：\n 核心课程：网络营销、网络金融与支付(区块链)、供应链与物流管理\n 辅助课程：网络交易、客户关系管理、电子商务安全、电子商务服务、社会化营销*\n 课程组成员：何建民（组长）、赵菊（协助）、凌海峰（协助）、李应、毛雪岷、杨爱峰、尹朋珍、许君','2017-12-24 19:51:22','2017-12-24 19:51:22',0),('800bb718eeef47799324de47bf35b22e','stuuuuring','sjjjtring','sxxxx','2017-12-06 14:25:41','2017-12-06 14:25:41',0),('95c9c535a48448b79dd222fd4bc82824','13','1321','23123','2017-12-06 15:04:07','2017-12-06 15:04:07',0),('9d6bfcaef8124771abf8d0620a79880d','132','1321','231','2017-12-06 15:04:02','2017-12-06 15:04:02',0),('a678fbb965b8456abf9f13270fdf0119','B01','思想政治素质类课程组','该课程组主要包含以下课程：\n       形式与政策、英语、大学体育、毛泽东思想与中国特色社会主义理论、马克思主义基本原理概论、中国近代史纲要、思想道德修养与法律基础、军事理论、大学生心理健康。','2017-12-24 19:47:29','2017-12-24 19:47:29',0),('aa945c0e9d8d47e880f3d67bdcb7ec28','13145312','f','否','2017-12-19 16:55:56','2017-12-19 16:55:56',0),('aee7ef99fd204bb3b501c7329d8b8e8e','12','21','32','2017-12-06 15:03:43','2017-12-06 15:03:43',1),('af52604f76de4c358d2079c8541173ca','string','tttttest','string','2017-12-03 11:16:57','2017-12-03 11:16:57',0),('d9d60b3767be4579b9884a1994982346','12','1dd','1d','2017-12-06 14:51:57','2017-12-06 14:51:57',1),('e113e408e04c434ba9890986cd9e9696','34456','gh213','vh','2017-12-06 14:52:19','2017-12-24 19:27:53',0);
=======
INSERT INTO `coursegroup` VALUES ('1','1','1',NULL,'2017-12-24 19:49:27','2017-12-24 19:49:27',0),('2','2','2',NULL,'2017-12-24 19:49:27','2017-12-24 19:49:27',0),('2aac25c733a347edad60e7e1fcc8b25d','B02','数理基础类课程组','该课程组主要包含以下课程：  高等数学A、大学物理C、大学物理实验、线性代数、概率论与数理统计、工程图学C。','2017-12-24 19:49:27','2017-12-24 19:55:29',0),('3c23544462724655a43f32b2969a3b3b','A04','电商系统设计与开发课程组','该课程组主要包含以下课程组：\n  核心课程：信息系统分析与设计、移动开发技术 \n  辅助课程：程序设计语言、计算机科学基础、数据库原理与应用、JAVA程序设计（课程设计）、JAVA高级应用（课程设计）、UML及其建模工\n  具、Python*\n  课程组成员：倪志伟（组长）、伍章俊（协助）、刘林、程浩、倪丽萍、余本功、张强','2017-12-24 19:52:19','2017-12-24 19:52:19',0),('57d4167b2d0a4d708c2f6a18db1f49a6','A06','创新创业课程组','该课程组主要包含以下课程：\n   核心课程：电子商务综合实践实训\n   辅助课程：电子商务发展专题、毕业论文/设计、创业管理、创新创业教育\n   课程组成员：姜元春（组长）、李应（协助）、赵菊、李锋刚、程八一','2017-12-24 19:54:19','2017-12-24 19:54:19',0),('64c0fbe7e7244a738ea3a84d9933b5b2','A05','商务数据建模与分析课程组','该课程组主要包含以下课程：\n  \t核心课程：运筹学、管理统计学、商务智能与大数据分析、人工智能*\n        辅助课程：离散数学、管理决策分析、商业研究方法、管理信息学、计量经济学、个性化推荐*\n        课程组成员：刘心报（组长）、姜元春（协助）、裴军（协助）、孙见山、江兵、方必和、周谧、裴凤、陈夏雨、王刚、许启发、孙春华','2017-12-24 19:53:18','2017-12-24 19:53:18',0),('68e5fd59723c455093b3a9dbcdcdf914','A02','电子商务基础课程','该课程组主要包含以下课程：\n  核心课程：电子商务概论\n  辅助课程：企业管理学、电子商务专业导论、电子商务案例分析、经济法（含电子商务法）、经济学、电子商务专业英语\n  课程组成员：刘业政（组长）、倪丽萍（协助）、电子商务系全体老师及学院平台课老师','2017-12-24 19:50:23','2017-12-26 17:56:32',0),('764e0bb0a6004a49b2832f8ee8181731','A03','电商运营与服务课程组','该课程组主要包含以下课程：\n 核心课程：网络营销、网络金融与支付(区块链)、供应链与物流管理\n 辅助课程：网络交易、客户关系管理、电子商务安全、电子商务服务、社会化营销*\n 课程组成员：何建民（组长）、赵菊（协助）、凌海峰（协助）、李应、毛雪岷、杨爱峰、尹朋珍、许君','2017-12-24 19:51:22','2017-12-24 19:51:22',0),('a678fbb965b8456abf9f13270fdf0119','B01','思想政治素质类课程组','该课程组主要包含以下课程：\n       形式与政策、英语、大学体育、毛泽东思想与中国特色社会主义理论、马克思主义基本原理概论、中国近代史纲要、思想道德修养与法律基础、军事理论、大学生心理健康。','2017-12-24 19:47:29','2017-12-24 19:47:29',0);
>>>>>>> seperate

#
# Structure for table "coursegroup_course"
#

DROP TABLE IF EXISTS `coursegroup_course`;
CREATE TABLE `coursegroup_course` (
  `coursegroup_id` varchar(64) NOT NULL,
  `course_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`coursegroup_id`,`course_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "coursegroup_course"
#

<<<<<<< HEAD
INSERT INTO `coursegroup_course` VALUES ('2aac25c733a347edad60e7e1fcc8b25d','1ba8f61a23d64e6e939552e39602b06b','2017-12-24 20:22:39','2017-12-24 20:22:39',0),('2aac25c733a347edad60e7e1fcc8b25d','4486c2dc6da44bf3ab4ca450ab22f50b','2017-12-24 20:22:13','2017-12-24 20:22:13',0),('2aac25c733a347edad60e7e1fcc8b25d','63be3c4a046b4156a4ab68c58331ad46','2017-12-24 20:21:52','2017-12-24 20:21:52',0),('2aac25c733a347edad60e7e1fcc8b25d','6d6d1186c4494c7a93914b3754c1eaac','2017-12-24 20:23:36','2017-12-24 20:23:36',0),('2aac25c733a347edad60e7e1fcc8b25d','c4a70eeea2b94004a4d0440a3e137ebd','2017-12-24 20:23:04','2017-12-24 20:23:04',0),('2aac25c733a347edad60e7e1fcc8b25d','d9441495006543b28ef50163f11e5913','2017-12-24 20:24:08','2017-12-24 20:24:08',0),('35e8a660a06640f4aa3f3043176e5418','d703a9696bae4fd394647a6e50da3022','2017-11-30 14:29:15','2017-11-30 14:29:15',0),('3c23544462724655a43f32b2969a3b3b','17bfbbcd244b4f5b9a15df2b43ce87b9','2017-12-24 20:38:20','2017-12-24 20:38:20',0),('3c23544462724655a43f32b2969a3b3b','1a80be5c25a641529d4f439546c0700f','2017-12-24 20:39:27','2017-12-24 20:39:27',0),('3c23544462724655a43f32b2969a3b3b','2d097c854e5849648d7f9285ca72e602','2017-12-24 20:37:17','2017-12-24 20:37:17',0),('3c23544462724655a43f32b2969a3b3b','38381e9deba64eb5b8803df07b5a756c','2017-12-24 20:36:29','2017-12-24 20:36:29',0),('3c23544462724655a43f32b2969a3b3b','54e03bc9e2d24f90aabd13bd8d6d11dd','2017-12-24 20:34:47','2017-12-24 20:34:47',0),('3c23544462724655a43f32b2969a3b3b','a76d96680af840818cef65ec9b1f5893','2017-12-24 20:37:54','2017-12-24 20:37:54',0),('3c23544462724655a43f32b2969a3b3b','abd953040f24406493c5229abc67ed79','2017-12-24 20:35:12','2017-12-24 20:35:12',0),('3c23544462724655a43f32b2969a3b3b','f35a95424907463f93c9cecd6afec2a3','2017-12-24 20:39:00','2017-12-24 20:39:00',0),('3c23544462724655a43f32b2969a3b3b','f5f82afd1f3d421d818f5fae9ba07b68','2017-12-24 20:35:40','2017-12-24 20:35:40',0),('57d4167b2d0a4d708c2f6a18db1f49a6','0a497b0c5ae443869938232979b03e9f','2017-12-24 20:46:48','2017-12-24 20:46:48',0),('57d4167b2d0a4d708c2f6a18db1f49a6','74615fae2f434219abf8753797f77a94','2017-12-24 20:47:12','2017-12-24 20:47:12',0),('57d4167b2d0a4d708c2f6a18db1f49a6','7b72db9416c640f6b61305cc6c4b772e','2017-12-24 20:46:03','2017-12-24 20:46:03',0),('57d4167b2d0a4d708c2f6a18db1f49a6','c22dc588c4e642e28b4fbf0e5266584e','2017-12-24 20:45:27','2017-12-24 20:45:27',0),('57d4167b2d0a4d708c2f6a18db1f49a6','c6f694ee59fb4b08aac806682beaf36d','2017-12-24 20:47:36','2017-12-24 20:47:36',0),('64c0fbe7e7244a738ea3a84d9933b5b2','02acad2b6d7f468da1435055a2b72443','2017-12-24 20:43:18','2017-12-24 20:43:18',0),('64c0fbe7e7244a738ea3a84d9933b5b2','55bb7cb3be5b44349675090f61cc56e5','2017-12-24 20:41:00','2017-12-24 20:41:00',0),('64c0fbe7e7244a738ea3a84d9933b5b2','63b9db88035b4433b23979dec9cde6a6','2017-12-24 20:42:12','2017-12-24 20:42:12',0),('64c0fbe7e7244a738ea3a84d9933b5b2','80450753b02445eda613ebcfae9cfaa5','2017-12-24 20:40:35','2017-12-24 20:40:35',0),('64c0fbe7e7244a738ea3a84d9933b5b2','96ffabbebc3f4ec8aeeb66f3f4f39d24','2017-12-24 20:42:43','2017-12-24 20:42:43',0),('64c0fbe7e7244a738ea3a84d9933b5b2','ac03ee1529e34586b2b34f0a37e1f224','2017-12-24 20:41:39','2017-12-24 20:41:39',0),('64c0fbe7e7244a738ea3a84d9933b5b2','bee646f3d731496bb9a67e7684294670','2017-12-24 20:43:46','2017-12-24 20:43:46',0),('64c0fbe7e7244a738ea3a84d9933b5b2','c4a7b01ded644212bce6e8c39963a4f0','2017-12-24 20:44:51','2017-12-24 20:44:51',0),('64c0fbe7e7244a738ea3a84d9933b5b2','dfd8c01f7edc4bf8873d688396552e12','2017-12-24 20:40:08','2017-12-24 20:40:08',0),('64c0fbe7e7244a738ea3a84d9933b5b2','ed7de5d5525a437e9b234b1934f8ed89','2017-12-24 20:44:10','2017-12-24 20:44:10',0),('68e5fd59723c455093b3a9dbcdcdf914','2c6e1f38838a4e74b2a742e968867c82','2017-12-24 20:28:13','2017-12-24 20:28:13',0),('68e5fd59723c455093b3a9dbcdcdf914','458d0ee25a6f4c76ba7c66cb6f9fb684','2017-12-24 20:27:04','2017-12-24 20:27:04',0),('68e5fd59723c455093b3a9dbcdcdf914','47a4c912bd774054afc9116490af7cf8','2017-12-24 20:24:52','2017-12-24 20:24:52',0),('68e5fd59723c455093b3a9dbcdcdf914','8e2abff457c84db8b4b71b44e2373a79','2017-12-24 20:29:01','2017-12-24 20:29:01',0),('68e5fd59723c455093b3a9dbcdcdf914','937a1b99a70e4bd9adcdafc2a87e38c9','2017-12-24 20:25:31','2017-12-24 20:25:31',0),('68e5fd59723c455093b3a9dbcdcdf914','96fb9435f15642328520cad703e32e67','2017-12-24 20:27:41','2017-12-24 20:27:41',0),('68e5fd59723c455093b3a9dbcdcdf914','dfd1575c3b634d0cbf91f06658e1084d','2017-12-24 20:26:29','2017-12-24 20:26:29',0),('764e0bb0a6004a49b2832f8ee8181731','3067bec0fae449b4b475ffacd86aeb3c','2017-12-24 20:31:20','2017-12-24 20:31:20',0),('764e0bb0a6004a49b2832f8ee8181731','56d754b9edcc47dc9c98a1a49ebf9745','2017-12-24 20:33:30','2017-12-24 20:33:30',0),('764e0bb0a6004a49b2832f8ee8181731','68be5e7ee8d64caca1727c4b00a67b9a','2017-12-24 20:33:57','2017-12-24 20:33:57',0),('764e0bb0a6004a49b2832f8ee8181731','68f5f3cf5f1341469b54a97c7693e9bc','2017-12-24 20:31:56','2017-12-24 20:31:56',0),('764e0bb0a6004a49b2832f8ee8181731','a5cebe6309904802b4ed65b6bba5a985','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('764e0bb0a6004a49b2832f8ee8181731','c1722db650f54ac68029b4341281e755','2017-12-24 20:32:20','2017-12-24 20:32:20',0),('764e0bb0a6004a49b2832f8ee8181731','d28d0d16aef24cadb666a35eb5c74f3d','2017-12-24 20:30:37','2017-12-24 20:30:37',0),('764e0bb0a6004a49b2832f8ee8181731','d6d267c4fff7433f974c6898f653afc6','2017-12-24 20:32:52','2017-12-24 20:32:52',0),('a678fbb965b8456abf9f13270fdf0119','1e1cb4677feb488c86ba9e1b618a6357','2017-12-24 20:16:56','2017-12-24 20:16:56',0),('a678fbb965b8456abf9f13270fdf0119','566e51f81efe40a2961dcbbeb31d85cf','2017-12-24 20:20:19','2017-12-24 20:20:19',0),('a678fbb965b8456abf9f13270fdf0119','5dbcdabac52d4a968f791a99842c3310','2017-12-24 20:19:38','2017-12-24 20:19:38',0),('a678fbb965b8456abf9f13270fdf0119','805396da52b3420293cae4845a0c7236','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('a678fbb965b8456abf9f13270fdf0119','925a54e418d240ce8c309c19df4616d6','2017-12-24 20:17:28','2017-12-24 20:17:28',0),('a678fbb965b8456abf9f13270fdf0119','9be614b2aaeb41579810c4ada43988ad','2017-12-24 20:16:20','2017-12-24 20:16:20',0),('a678fbb965b8456abf9f13270fdf0119','a8e4f84fa7044d219675f4ccc9f5c7c3','2017-12-24 20:20:43','2017-12-24 20:20:43',0),('a678fbb965b8456abf9f13270fdf0119','ada5cddcb5764768bba89a1e9f49850d','2017-12-24 20:21:20','2017-12-24 20:21:20',0),('a678fbb965b8456abf9f13270fdf0119','de419d0bd25743f0b19ae5a97ecb45e5','2017-12-24 20:18:54','2017-12-24 20:18:54',0),('af52604f76de4c358d2079c8541173ca','223a742b176b4aa68dba50c49b81dd84','2017-12-06 19:22:05','2017-12-06 19:22:05',0),('d9d60b3767be4579b9884a1994982346','fccc4a78cd014b2cad09f0499e35e21c','2017-12-06 19:19:00','2017-12-06 19:19:00',1),('e113e408e04c434ba9890986cd9e9696','a07274e3e90c446ea5e464df040d9c46','2017-12-06 19:17:11','2017-12-06 19:17:11',1),('e113e408e04c434ba9890986cd9e9696','dc9d54e7057c4be597feed6a66b2b729','2017-12-06 19:18:12','2017-12-06 19:18:12',0),('e113e408e04c434ba9890986cd9e9696','f905c98b75824c61814002e44c1ed75b','2017-12-06 19:10:20','2017-12-06 19:10:20',0);
=======
INSERT INTO `coursegroup_course` VALUES ('1','1','0000-00-00 00:00:00','0000-00-00 00:00:00',0),('1','8','2017-12-26 23:04:52','2017-12-26 23:04:52',0),('2','8','2017-12-28 19:17:18','2017-12-28 19:17:18',1),('2aac25c733a347edad60e7e1fcc8b25d','1ba8f61a23d64e6e939552e39602b06b','2017-12-24 20:22:39','2017-12-24 20:22:39',0),('2aac25c733a347edad60e7e1fcc8b25d','4486c2dc6da44bf3ab4ca450ab22f50b','2017-12-24 20:22:13','2017-12-24 20:22:13',0),('2aac25c733a347edad60e7e1fcc8b25d','63be3c4a046b4156a4ab68c58331ad46','2017-12-24 20:21:52','2017-12-24 20:21:52',0),('2aac25c733a347edad60e7e1fcc8b25d','6d6d1186c4494c7a93914b3754c1eaac','2017-12-24 20:23:36','2017-12-24 20:23:36',0),('2aac25c733a347edad60e7e1fcc8b25d','c4a70eeea2b94004a4d0440a3e137ebd','2017-12-24 20:23:04','2017-12-24 20:23:04',0),('2aac25c733a347edad60e7e1fcc8b25d','d9441495006543b28ef50163f11e5913','2017-12-24 20:24:08','2017-12-24 20:24:08',0),('3c23544462724655a43f32b2969a3b3b','17bfbbcd244b4f5b9a15df2b43ce87b9','2017-12-24 20:38:20','2017-12-24 20:38:20',0),('3c23544462724655a43f32b2969a3b3b','1a80be5c25a641529d4f439546c0700f','2017-12-24 20:39:27','2017-12-24 20:39:27',0),('3c23544462724655a43f32b2969a3b3b','2d097c854e5849648d7f9285ca72e602','2017-12-24 20:37:17','2017-12-24 20:37:17',0),('3c23544462724655a43f32b2969a3b3b','38381e9deba64eb5b8803df07b5a756c','2017-12-24 20:36:29','2017-12-24 20:36:29',0),('3c23544462724655a43f32b2969a3b3b','54e03bc9e2d24f90aabd13bd8d6d11dd','2017-12-24 20:34:47','2017-12-24 20:34:47',0),('3c23544462724655a43f32b2969a3b3b','a76d96680af840818cef65ec9b1f5893','2017-12-24 20:37:54','2017-12-24 20:37:54',0),('3c23544462724655a43f32b2969a3b3b','abd953040f24406493c5229abc67ed79','2017-12-24 20:35:12','2017-12-24 20:35:12',0),('3c23544462724655a43f32b2969a3b3b','f35a95424907463f93c9cecd6afec2a3','2017-12-24 20:39:00','2017-12-24 20:39:00',0),('3c23544462724655a43f32b2969a3b3b','f5f82afd1f3d421d818f5fae9ba07b68','2017-12-24 20:35:40','2017-12-24 20:35:40',0),('57d4167b2d0a4d708c2f6a18db1f49a6','0a497b0c5ae443869938232979b03e9f','2017-12-24 20:46:48','2017-12-24 20:46:48',0),('57d4167b2d0a4d708c2f6a18db1f49a6','74615fae2f434219abf8753797f77a94','2017-12-24 20:47:12','2017-12-24 20:47:12',0),('57d4167b2d0a4d708c2f6a18db1f49a6','7b72db9416c640f6b61305cc6c4b772e','2017-12-24 20:46:03','2017-12-24 20:46:03',0),('57d4167b2d0a4d708c2f6a18db1f49a6','c22dc588c4e642e28b4fbf0e5266584e','2017-12-24 20:45:27','2017-12-24 20:45:27',0),('57d4167b2d0a4d708c2f6a18db1f49a6','c6f694ee59fb4b08aac806682beaf36d','2017-12-24 20:47:36','2017-12-24 20:47:36',0),('64c0fbe7e7244a738ea3a84d9933b5b2','02acad2b6d7f468da1435055a2b72443','2017-12-24 20:43:18','2017-12-24 20:43:18',0),('64c0fbe7e7244a738ea3a84d9933b5b2','55bb7cb3be5b44349675090f61cc56e5','2017-12-24 20:41:00','2017-12-24 20:41:00',0),('64c0fbe7e7244a738ea3a84d9933b5b2','63b9db88035b4433b23979dec9cde6a6','2017-12-24 20:42:12','2017-12-24 20:42:12',0),('64c0fbe7e7244a738ea3a84d9933b5b2','80450753b02445eda613ebcfae9cfaa5','2017-12-24 20:40:35','2017-12-24 20:40:35',0),('64c0fbe7e7244a738ea3a84d9933b5b2','96ffabbebc3f4ec8aeeb66f3f4f39d24','2017-12-24 20:42:43','2017-12-24 20:42:43',0),('64c0fbe7e7244a738ea3a84d9933b5b2','ac03ee1529e34586b2b34f0a37e1f224','2017-12-24 20:41:39','2017-12-24 20:41:39',0),('64c0fbe7e7244a738ea3a84d9933b5b2','bee646f3d731496bb9a67e7684294670','2017-12-24 20:43:46','2017-12-24 20:43:46',0),('64c0fbe7e7244a738ea3a84d9933b5b2','c4a7b01ded644212bce6e8c39963a4f0','2017-12-24 20:44:51','2017-12-24 20:44:51',0),('64c0fbe7e7244a738ea3a84d9933b5b2','dfd8c01f7edc4bf8873d688396552e12','2017-12-24 20:40:08','2017-12-24 20:40:08',0),('64c0fbe7e7244a738ea3a84d9933b5b2','ed7de5d5525a437e9b234b1934f8ed89','2017-12-24 20:44:10','2017-12-24 20:44:10',0),('68e5fd59723c455093b3a9dbcdcdf914','2c6e1f38838a4e74b2a742e968867c82','2017-12-24 20:28:13','2017-12-24 20:28:13',1),('68e5fd59723c455093b3a9dbcdcdf914','458d0ee25a6f4c76ba7c66cb6f9fb684','2017-12-24 20:27:04','2017-12-24 20:27:04',0),('68e5fd59723c455093b3a9dbcdcdf914','47a4c912bd774054afc9116490af7cf8','2017-12-24 20:24:52','2017-12-24 20:24:52',0),('68e5fd59723c455093b3a9dbcdcdf914','8e2abff457c84db8b4b71b44e2373a79','2017-12-24 20:29:01','2017-12-24 20:29:01',0),('68e5fd59723c455093b3a9dbcdcdf914','937a1b99a70e4bd9adcdafc2a87e38c9','2017-12-24 20:25:31','2017-12-24 20:25:31',0),('68e5fd59723c455093b3a9dbcdcdf914','96fb9435f15642328520cad703e32e67','2017-12-24 20:27:41','2017-12-24 20:27:41',0),('68e5fd59723c455093b3a9dbcdcdf914','dfd1575c3b634d0cbf91f06658e1084d','2017-12-24 20:26:29','2017-12-24 20:26:29',0),('764e0bb0a6004a49b2832f8ee8181731','3067bec0fae449b4b475ffacd86aeb3c','2017-12-24 20:31:20','2017-12-24 20:31:20',0),('764e0bb0a6004a49b2832f8ee8181731','56d754b9edcc47dc9c98a1a49ebf9745','2017-12-24 20:33:30','2017-12-24 20:33:30',0),('764e0bb0a6004a49b2832f8ee8181731','68be5e7ee8d64caca1727c4b00a67b9a','2017-12-24 20:33:57','2017-12-24 20:33:57',0),('764e0bb0a6004a49b2832f8ee8181731','68f5f3cf5f1341469b54a97c7693e9bc','2017-12-24 20:31:56','2017-12-24 20:31:56',0),('764e0bb0a6004a49b2832f8ee8181731','a5cebe6309904802b4ed65b6bba5a985','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('764e0bb0a6004a49b2832f8ee8181731','c1722db650f54ac68029b4341281e755','2017-12-24 20:32:20','2017-12-24 20:32:20',0),('764e0bb0a6004a49b2832f8ee8181731','d28d0d16aef24cadb666a35eb5c74f3d','2017-12-24 20:30:37','2017-12-24 20:30:37',0),('764e0bb0a6004a49b2832f8ee8181731','d6d267c4fff7433f974c6898f653afc6','2017-12-24 20:32:52','2017-12-24 20:32:52',0),('a678fbb965b8456abf9f13270fdf0119','1e1cb4677feb488c86ba9e1b618a6357','2017-12-24 20:16:56','2017-12-24 20:16:56',0),('a678fbb965b8456abf9f13270fdf0119','566e51f81efe40a2961dcbbeb31d85cf','2017-12-24 20:20:19','2017-12-24 20:20:19',0),('a678fbb965b8456abf9f13270fdf0119','5dbcdabac52d4a968f791a99842c3310','2017-12-24 20:19:38','2017-12-24 20:19:38',0),('a678fbb965b8456abf9f13270fdf0119','805396da52b3420293cae4845a0c7236','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('a678fbb965b8456abf9f13270fdf0119','925a54e418d240ce8c309c19df4616d6','2017-12-24 20:17:28','2017-12-24 20:17:28',0),('a678fbb965b8456abf9f13270fdf0119','9be614b2aaeb41579810c4ada43988ad','2017-12-24 20:16:20','2017-12-24 20:16:20',0),('a678fbb965b8456abf9f13270fdf0119','a8e4f84fa7044d219675f4ccc9f5c7c3','2017-12-24 20:20:43','2017-12-24 20:20:43',0),('a678fbb965b8456abf9f13270fdf0119','ada5cddcb5764768bba89a1e9f49850d','2017-12-24 20:21:20','2017-12-24 20:21:20',0),('a678fbb965b8456abf9f13270fdf0119','de419d0bd25743f0b19ae5a97ecb45e5','2017-12-24 20:18:54','2017-12-24 20:18:54',0);
>>>>>>> seperate

#
# Structure for table "coursegroup_picture"
#

DROP TABLE IF EXISTS `coursegroup_picture`;
CREATE TABLE `coursegroup_picture` (
  `coursegroup_id` varchar(64) NOT NULL,
  `picture_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`coursegroup_id`,`picture_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "coursegroup_picture"
#


#
# Structure for table "coursegroup_teacher"
#

DROP TABLE IF EXISTS `coursegroup_teacher`;
CREATE TABLE `coursegroup_teacher` (
  `coursegroup_id` varchar(64) NOT NULL,
  `teacher_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`coursegroup_id`,`teacher_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "coursegroup_teacher"
#

<<<<<<< HEAD
INSERT INTO `coursegroup_teacher` VALUES ('35e8a660a06640f4aa3f3043176e5418','6555b97be4604fb3a20ffd2e0d911a3c','2017-11-29 15:54:21','2017-11-29 15:54:21',0),('3c23544462724655a43f32b2969a3b3b','0ca5585c80f94896955c42bf37d552f8','2017-12-24 20:06:57','2017-12-24 20:06:57',0),('3c23544462724655a43f32b2969a3b3b','1873a5ba9b6f426b9b5e0d9b7e6ce39e','2017-12-24 20:07:40','2017-12-24 20:07:40',0),('3c23544462724655a43f32b2969a3b3b','321a1996c424434895b93ece7ab855c5','2017-12-24 20:06:33','2017-12-24 20:06:33',0),('3c23544462724655a43f32b2969a3b3b','79e96623f593463db8a64ab147e87126','2017-12-24 20:05:53','2017-12-24 20:05:53',0),('3c23544462724655a43f32b2969a3b3b','8eda7ae527fe46a3a6accafdbc2ed57f','2017-12-24 20:06:09','2017-12-24 20:06:09',0),('3c23544462724655a43f32b2969a3b3b','bf5911ed66e246999844ee4a2253b968','2017-12-24 20:07:58','2017-12-24 20:07:58',0),('57d4167b2d0a4d708c2f6a18db1f49a6','55e954542c8247dfb02723b02b815dc4','2017-12-24 20:14:21','2017-12-24 20:14:21',0),('57d4167b2d0a4d708c2f6a18db1f49a6','de7fdb3d03b4422aae438ebd0a5b2532','2017-12-24 20:14:42','2017-12-24 20:14:42',0),('64c0fbe7e7244a738ea3a84d9933b5b2','11553bf79b5c44a5acf9966cb01850fb','2017-12-24 20:10:53','2017-12-24 20:10:53',0),('64c0fbe7e7244a738ea3a84d9933b5b2','17dae3df2d2a49ce97dbacaae43ffab5','2017-12-24 20:08:24','2017-12-24 20:08:24',0),('64c0fbe7e7244a738ea3a84d9933b5b2','1f133fd5993e477bbf7e7cbf1dc140d3','2017-12-24 20:10:32','2017-12-24 20:10:32',0),('64c0fbe7e7244a738ea3a84d9933b5b2','1f6d8c7d89684960b064d0512bc89a51','2017-12-24 20:12:12','2017-12-24 20:12:12',0),('64c0fbe7e7244a738ea3a84d9933b5b2','25574c94dd4a43b9a83338bbf3d5f44f','2017-12-24 20:11:36','2017-12-24 20:11:36',0),('64c0fbe7e7244a738ea3a84d9933b5b2','2caefb42a6424361a7cbb7df8c61e11f','2017-12-24 20:12:32','2017-12-24 20:12:32',0),('64c0fbe7e7244a738ea3a84d9933b5b2','538927a853fb4dd5b6f217d13114170a','2017-12-24 20:13:41','2017-12-24 20:13:41',0),('64c0fbe7e7244a738ea3a84d9933b5b2','60702dbff9874c6e8e1a98631f8b60e7','2017-12-24 20:12:50','2017-12-24 20:12:50',0),('64c0fbe7e7244a738ea3a84d9933b5b2','68c38c713ecc4e89977e4be00c90504a','2017-12-24 20:13:15','2017-12-24 20:13:15',0),('64c0fbe7e7244a738ea3a84d9933b5b2','a9e8bb2e27cb4961af2171a805f76f25','2017-12-24 20:10:08','2017-12-24 20:10:08',0),('64c0fbe7e7244a738ea3a84d9933b5b2','c3106a52473543a58c3282871a72d952','2017-12-24 20:09:36','2017-12-24 20:09:36',0),('64c0fbe7e7244a738ea3a84d9933b5b2','e62c70cfeada48ef9097c409ffcab8e1','2017-12-24 20:11:13','2017-12-24 20:11:13',0),('68e5fd59723c455093b3a9dbcdcdf914','4e292a64b03f45cca5d9bde947b03295','2017-12-24 20:00:53','2017-12-24 20:00:53',0),('68e5fd59723c455093b3a9dbcdcdf914','68bf1c2b97ef4be5b58cd03aeb74dd65','2017-12-24 20:01:38','2017-12-24 20:01:38',0),('68e5fd59723c455093b3a9dbcdcdf914','b240547d9aa944f9bfe3de8696875062','2017-12-24 20:00:21','2017-12-24 20:00:21',0),('764e0bb0a6004a49b2832f8ee8181731','039f6fa77c6b48048fa9d941f6d5e95c','2017-12-24 20:02:02','2017-12-24 20:02:02',0),('764e0bb0a6004a49b2832f8ee8181731','15f6d17221004112878a22a90bda302a','2017-12-24 20:03:06','2017-12-24 20:03:06',0),('764e0bb0a6004a49b2832f8ee8181731','1ac2eb0c730740868ac66f06321aa0af','2017-12-24 20:04:06','2017-12-24 20:04:06',0),('764e0bb0a6004a49b2832f8ee8181731','408f7e1c170745fb9d052a2206146d43','2017-12-24 20:05:29','2017-12-24 20:05:29',0),('764e0bb0a6004a49b2832f8ee8181731','644b84935201474fb959e7b6ae616cb2','2017-12-24 20:02:33','2017-12-24 20:02:33',0),('764e0bb0a6004a49b2832f8ee8181731','a1f642a6461a4da585b3591147ab7607','2017-12-24 20:05:12','2017-12-24 20:05:12',0),('764e0bb0a6004a49b2832f8ee8181731','bcd6e841bd55476e9588c180b0cddbce','2017-12-24 20:04:34','2017-12-24 20:04:34',0),('764e0bb0a6004a49b2832f8ee8181731','d21b2bad365f46799bfb4fa35a8702cb','2017-12-24 20:03:37','2017-12-24 20:03:37',0),('95c9c535a48448b79dd222fd4bc82824','06eb98c1cded46e3a90d8cbf1d200147','2017-12-06 20:10:07','2017-12-06 20:10:07',0),('a678fbb965b8456abf9f13270fdf0119','ac31baa93efe4a11b8cc78675fdeeccc','2017-12-24 19:57:48','2017-12-24 19:57:48',0),('af52604f76de4c358d2079c8541173ca','d2d2cefe43884041880b16b4a7ae8982','2017-12-06 19:49:39','2017-12-06 19:49:39',0),('d9d60b3767be4579b9884a1994982346','b580f4172c344f65a79dacac9c0bbc61','2017-12-06 19:50:02','2017-12-06 19:50:02',1),('d9d60b3767be4579b9884a1994982346','ea8ef4e8b0aa49ebaef0d6b845704a2c','2017-12-06 19:52:47','2017-12-06 19:52:47',1),('e113e408e04c434ba9890986cd9e9696','63306e4a88f7444d801d7f6d0f43ae86','2017-12-24 18:40:39','2017-12-24 18:40:39',1);
=======
INSERT INTO `coursegroup_teacher` VALUES ('1','3','0000-00-00 00:00:00','0000-00-00 00:00:00',0),('1','4','0000-00-00 00:00:00','0000-00-00 00:00:00',0),('2','3','2017-12-28 19:17:18','2017-12-28 19:17:18',0),('2','4','2017-12-28 19:17:18','2017-12-28 19:17:18',0),('3c23544462724655a43f32b2969a3b3b','0ca5585c80f94896955c42bf37d552f8','2017-12-24 20:06:57','2017-12-24 20:06:57',0),('3c23544462724655a43f32b2969a3b3b','1873a5ba9b6f426b9b5e0d9b7e6ce39e','2017-12-24 20:07:40','2017-12-24 20:07:40',0),('3c23544462724655a43f32b2969a3b3b','321a1996c424434895b93ece7ab855c5','2017-12-24 20:06:33','2017-12-24 20:06:33',0),('3c23544462724655a43f32b2969a3b3b','79e96623f593463db8a64ab147e87126','2017-12-24 20:05:53','2017-12-24 20:05:53',0),('3c23544462724655a43f32b2969a3b3b','8eda7ae527fe46a3a6accafdbc2ed57f','2017-12-24 20:06:09','2017-12-24 20:06:09',0),('3c23544462724655a43f32b2969a3b3b','bf5911ed66e246999844ee4a2253b968','2017-12-24 20:07:58','2017-12-24 20:07:58',0),('57d4167b2d0a4d708c2f6a18db1f49a6','55e954542c8247dfb02723b02b815dc4','2017-12-24 20:14:21','2017-12-24 20:14:21',0),('57d4167b2d0a4d708c2f6a18db1f49a6','de7fdb3d03b4422aae438ebd0a5b2532','2017-12-24 20:14:42','2017-12-24 20:14:42',0),('64c0fbe7e7244a738ea3a84d9933b5b2','11553bf79b5c44a5acf9966cb01850fb','2017-12-24 20:10:53','2017-12-24 20:10:53',0),('64c0fbe7e7244a738ea3a84d9933b5b2','17dae3df2d2a49ce97dbacaae43ffab5','2017-12-24 20:08:24','2017-12-24 20:08:24',0),('64c0fbe7e7244a738ea3a84d9933b5b2','1f133fd5993e477bbf7e7cbf1dc140d3','2017-12-24 20:10:32','2017-12-24 20:10:32',0),('64c0fbe7e7244a738ea3a84d9933b5b2','1f6d8c7d89684960b064d0512bc89a51','2017-12-24 20:12:12','2017-12-24 20:12:12',0),('64c0fbe7e7244a738ea3a84d9933b5b2','25574c94dd4a43b9a83338bbf3d5f44f','2017-12-24 20:11:36','2017-12-24 20:11:36',0),('64c0fbe7e7244a738ea3a84d9933b5b2','2caefb42a6424361a7cbb7df8c61e11f','2017-12-24 20:12:32','2017-12-24 20:12:32',0),('64c0fbe7e7244a738ea3a84d9933b5b2','538927a853fb4dd5b6f217d13114170a','2017-12-24 20:13:41','2017-12-24 20:13:41',0),('64c0fbe7e7244a738ea3a84d9933b5b2','60702dbff9874c6e8e1a98631f8b60e7','2017-12-24 20:12:50','2017-12-24 20:12:50',0),('64c0fbe7e7244a738ea3a84d9933b5b2','68c38c713ecc4e89977e4be00c90504a','2017-12-24 20:13:15','2017-12-24 20:13:15',0),('64c0fbe7e7244a738ea3a84d9933b5b2','a9e8bb2e27cb4961af2171a805f76f25','2017-12-24 20:10:08','2017-12-24 20:10:08',0),('64c0fbe7e7244a738ea3a84d9933b5b2','c3106a52473543a58c3282871a72d952','2017-12-24 20:09:36','2017-12-24 20:09:36',0),('64c0fbe7e7244a738ea3a84d9933b5b2','e62c70cfeada48ef9097c409ffcab8e1','2017-12-24 20:11:13','2017-12-24 20:11:13',0),('68e5fd59723c455093b3a9dbcdcdf914','4e292a64b03f45cca5d9bde947b03295','2017-12-24 20:00:53','2017-12-24 20:00:53',0),('68e5fd59723c455093b3a9dbcdcdf914','68bf1c2b97ef4be5b58cd03aeb74dd65','2017-12-24 20:01:38','2017-12-24 20:01:38',0),('68e5fd59723c455093b3a9dbcdcdf914','b240547d9aa944f9bfe3de8696875062','2017-12-24 20:00:21','2017-12-24 20:00:21',0),('764e0bb0a6004a49b2832f8ee8181731','039f6fa77c6b48048fa9d941f6d5e95c','2017-12-24 20:02:02','2017-12-24 20:02:02',0),('764e0bb0a6004a49b2832f8ee8181731','15f6d17221004112878a22a90bda302a','2017-12-24 20:03:06','2017-12-24 20:03:06',0),('764e0bb0a6004a49b2832f8ee8181731','1ac2eb0c730740868ac66f06321aa0af','2017-12-24 20:04:06','2017-12-24 20:04:06',0),('764e0bb0a6004a49b2832f8ee8181731','408f7e1c170745fb9d052a2206146d43','2017-12-24 20:05:29','2017-12-24 20:05:29',0),('764e0bb0a6004a49b2832f8ee8181731','644b84935201474fb959e7b6ae616cb2','2017-12-24 20:02:33','2017-12-24 20:02:33',0),('764e0bb0a6004a49b2832f8ee8181731','a1f642a6461a4da585b3591147ab7607','2017-12-24 20:05:12','2017-12-24 20:05:12',0),('764e0bb0a6004a49b2832f8ee8181731','bcd6e841bd55476e9588c180b0cddbce','2017-12-24 20:04:34','2017-12-24 20:04:34',0),('764e0bb0a6004a49b2832f8ee8181731','d21b2bad365f46799bfb4fa35a8702cb','2017-12-24 20:03:37','2017-12-24 20:03:37',0),('a678fbb965b8456abf9f13270fdf0119','ac31baa93efe4a11b8cc78675fdeeccc','2017-12-24 19:57:48','2017-12-24 19:57:48',0);
>>>>>>> seperate

#
# Structure for table "exercise"
#

DROP TABLE IF EXISTS `exercise`;
CREATE TABLE `exercise` (
  `id` varchar(64) NOT NULL,
  `name` varchar(20) NOT NULL,
  `content` text NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "exercise"
#


#
# Structure for table "homework"
#

DROP TABLE IF EXISTS `homework`;
CREATE TABLE `homework` (
  `id` bigint(20) NOT NULL,
  `name` varchar(32) NOT NULL,
  `url` varchar(128) NOT NULL,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `is_delete` smallint(6) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

#
# Data for table "homework"
#


#
# Structure for table "inform"
#

DROP TABLE IF EXISTS `inform`;
CREATE TABLE `inform` (
  `id` bigint(20) NOT NULL,
  `title` varchar(64) NOT NULL,
  `content` text NOT NULL,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `is_delete` smallint(6) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

#
# Data for table "inform"
#


#
# Structure for table "knowledgepoint"
#

DROP TABLE IF EXISTS `knowledgepoint`;
CREATE TABLE `knowledgepoint` (
  `id` varchar(64) NOT NULL,
  `content` varchar(40) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "knowledgepoint"
#


#
# Structure for table "manager"
#

DROP TABLE IF EXISTS `manager`;
CREATE TABLE `manager` (
  `id` varchar(64) NOT NULL,
  `account` varchar(20) NOT NULL,
  `password` varchar(64) NOT NULL,
  `issuper` int(1) NOT NULL,
  `isDelete` int(1) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "manager"
#

<<<<<<< HEAD
INSERT INTO `manager` VALUES ('0d51e6a885014d34a6b0ff706a57013f','1','1',0,0,'2017-12-24 20:47:12','2017-12-24 20:47:12'),('1','1','1',1,0,'2017-11-29 15:08:25','2017-11-29 15:08:25'),('1279b329377c4a688b76a6066d3af5ff','1','1',0,0,'2017-12-24 20:40:08','2017-12-24 20:40:08'),('19bf355e33ea471b8ed3a34e2ba08ff9','1','1',0,0,'2017-12-24 20:45:27','2017-12-24 20:45:27'),('19bf40c394bb4946abf74975ca61426f','1','1',0,0,'2017-12-24 20:31:20','2017-12-24 20:31:20'),('1d079b212e934ac9bb13442483eff087','z','z',0,0,'2017-12-06 19:18:12','2017-12-06 19:18:12'),('1e66eac6a51c4243b456e98403b4c419','1','1',0,0,'2017-12-24 20:41:39','2017-12-24 20:41:39'),('1f447f4750fc4c858b507cd3b1807502','1','1',0,0,'2017-12-24 20:29:01','2017-12-24 20:29:01'),('2','2','2',0,1,'2017-11-29 15:08:25','2017-11-29 15:08:25'),('229891c88fe345d0a9791f6f5f8e6f1d','1','1',0,0,'2017-12-24 20:32:52','2017-12-24 20:32:52'),('292856f07d7c4df4a7e09e5b10ced80a','dsb','bzfd',0,0,'2017-12-06 19:22:05','2017-12-06 19:22:05'),('29fa8d10b2fa479fb1454312a5acdca0','1','1',0,0,'2017-12-24 20:19:38','2017-12-24 20:19:38'),('2f8bc29c759c4711b8213f37da0892ed','1','1',0,0,'2017-12-24 20:16:20','2017-12-24 20:16:20'),('328053d90a654e8eb1abf1f00d3b878c','1','1',0,0,'2017-12-24 20:20:19','2017-12-24 20:20:19'),('377b7ace22d84c7091a28f3bf6a44967','handsomeboy','yes',0,0,'2017-12-06 19:10:20','2017-12-06 19:10:20'),('3fdf771f273e40a8912d2e498aa6f0f1','1','1',0,0,'2017-12-24 20:35:40','2017-12-24 20:35:40'),('41e231c48b80406fb0fbe640bcc97030','1','1',0,0,'2017-12-24 20:23:36','2017-12-24 20:23:36'),('424db1dd6134472d8b5f8f43b7f89b18','1','1',0,0,'2017-12-24 20:44:10','2017-12-24 20:44:10'),('44fc8dd7856f408dbf7ec53c1a86a4d6','1','1',0,0,'2017-12-24 20:46:03','2017-12-24 20:46:03'),('494ae8ec8d5d45359d30df3d63e3bb8c','1','1',0,0,'2017-12-24 20:47:36','2017-12-24 20:47:36'),('5085f4ee0f9e4467a6178bd9d7a03d71','1','1',0,0,'2017-12-24 20:43:18','2017-12-24 20:43:18'),('50c9440a47b74e13bdd766c7cbe173e2','1','1',0,0,'2017-12-24 20:24:08','2017-12-24 20:24:08'),('637837a658ba45f48f6a47c8cb44a06c','1','1',0,0,'2017-12-24 20:38:20','2017-12-24 20:38:20'),('6c64129344e04c218072198b3782d6b5','1','1',0,0,'2017-12-24 20:18:54','2017-12-24 20:18:54'),('6ccd7409235a4855a20ad5ff0ceeeaba','1','1',0,0,'2017-12-24 20:41:00','2017-12-24 20:41:00'),('73cd3ace682a4f52ac970408c3f7cc71','1','1',0,0,'2017-12-24 20:37:17','2017-12-24 20:37:17'),('7c3fd1c4ae564f2d8015cf748eeb1204','1','1',0,0,'2017-12-24 20:21:20','2017-12-24 20:21:20'),('7e6ed667d5414452a6ccfeda849613ae','csa','cas',0,0,'2017-12-06 19:19:00','2017-12-07 11:26:36'),('9771852a4f2f4c908e5e9ed2b1da5380','1','1',0,0,'2017-12-24 20:33:57','2017-12-24 20:33:57'),('97fca9fb27c341308d48fd05fb9cf6cc','1','1',0,0,'2017-12-24 20:44:51','2017-12-24 20:44:51'),('9fba454270e14aacae89957b997ba2e0','1','1',0,0,'2017-12-24 20:29:45','2017-12-24 20:29:45'),('a32b94b35850480f9fdfb6a0db258467','1','1',0,0,'2017-12-24 20:39:27','2017-12-24 20:39:27'),('a3725aa9a9374ff6b2124cdf5ae0809d','1','1',0,0,'2017-12-24 20:33:30','2017-12-24 20:33:30'),('a79b4479557e4bb9819f67e1a1647480','1','1',0,0,'2017-12-24 20:43:46','2017-12-24 20:43:46'),('a79d2fe535c64e1dbf471b03ead75828','1','1',0,0,'2017-12-24 20:18:07','2017-12-24 20:18:07'),('a869fab9b47a4e22b134cee1037b2c21','1','1',0,0,'2017-12-24 20:46:48','2017-12-24 20:46:48'),('a8e994579b4d480cb1e8a582b7b13d34','1','1',0,0,'2017-12-24 20:25:31','2017-12-24 20:25:31'),('aa7759a2eaf44704a7a1833f751eec85','1','1',0,0,'2017-12-24 20:31:56','2017-12-24 20:31:56'),('aaeed146ce6f4e2fac7dbfea6b52daa4','1','1',0,0,'2017-12-24 20:22:13','2017-12-24 20:22:13'),('af082d369eca48f4964315266b91f66a','1','1',0,0,'2017-12-24 20:27:04','2017-12-24 20:27:04'),('b3beaabd1661409f857823d2c3beef99','1','1',0,0,'2017-12-24 20:23:04','2017-12-24 20:23:04'),('b48073d97c5f438a8a08ffefaa6a7f23','1','1',0,0,'2017-12-24 20:16:56','2017-12-24 20:16:56'),('bf82dbf282f8439b9cfe5caa5794ef12','1','1',0,0,'2017-12-24 20:30:37','2017-12-24 20:30:37'),('c0b3cd4e08644681be2fd91d2222ab23','1','1',0,0,'2017-12-24 20:39:00','2017-12-24 20:39:00'),('c57b273b716e4a36b472df551d78ed14','1','1',0,0,'2017-12-24 20:17:28','2017-12-24 20:17:28'),('c5e5b5ae76284519a8a4e46a065a0572','1','1',0,0,'2017-12-24 20:21:52','2017-12-24 20:21:52'),('c86d41834b85403db5dc8df84cba6352','1','1',0,0,'2017-12-24 20:35:12','2017-12-24 20:35:12'),('ca92ef19e42545a1a39bc5e508addff7','1','1',0,0,'2017-12-24 20:32:20','2017-12-24 20:32:20'),('d0c6a67d5f06457eaf886acd2f3ed162','1','1',0,0,'2017-12-24 20:34:47','2017-12-24 20:34:47'),('d1ecabfb49e84fd4988f41b6847e02f9','1','1',0,0,'2017-12-24 20:42:12','2017-12-24 20:42:12'),('d41843ce70494e9b92a7eae46b1b70ca','1','1',0,0,'2017-12-24 20:26:29','2017-12-24 20:26:29'),('d5d65db163ee4417a23a3aafa1daeebb','1','1',0,0,'2017-12-24 20:36:29','2017-12-24 20:36:29'),('d72bad075b85470dbc41fe957a820d9f','1','1',0,0,'2017-12-24 20:22:39','2017-12-24 20:22:39'),('d78e36df05654fcfb598afc7a6e0c39f','1','1',0,0,'2017-12-24 20:42:42','2017-12-24 20:42:42'),('e1ca5b0f66d74d0faa28edec5d80c961','1','1',0,0,'2017-12-24 20:28:13','2017-12-24 20:28:13'),('e680b2a717e54f559c979a041cdf5843','1','1',0,0,'2017-12-24 20:27:41','2017-12-24 20:27:41'),('ea9b986c4a0e4ff4a4a9053281c7eee4','string','string',0,0,'2017-11-30 14:29:14','2017-12-07 14:45:54'),('ef8e153f9cbe4863b8b7eab3f7900533','h','h',0,1,'2017-12-06 19:17:11','2017-12-06 19:17:11'),('f3b82a51518d4d09ab2c41d9d708d7da','1','1',0,0,'2017-12-24 20:40:35','2017-12-24 20:40:35'),('f3de5f23bb0148f19f0fce9c60ef63c2','1','1',0,0,'2017-12-24 20:20:43','2017-12-24 20:20:43'),('fbb949cfe17f42c39829a962aacfe287','1','1',0,0,'2017-12-24 20:24:52','2017-12-24 20:24:52'),('fcf5dac9920d40dc9fd53dcc4c758bcd','1','1',0,0,'2017-12-24 20:37:54','2017-12-24 20:37:54');
=======
INSERT INTO `manager` VALUES ('0d51e6a885014d34a6b0ff706a57013f','1','1',0,0,'2017-12-24 20:47:12','2017-12-24 20:47:12'),('1279b329377c4a688b76a6066d3af5ff','1','1',0,0,'2017-12-24 20:40:08','2017-12-24 20:40:08'),('19bf355e33ea471b8ed3a34e2ba08ff9','1','1',0,0,'2017-12-24 20:45:27','2017-12-24 20:45:27'),('19bf40c394bb4946abf74975ca61426f','1','1',0,0,'2017-12-24 20:31:20','2017-12-24 20:31:20'),('1e66eac6a51c4243b456e98403b4c419','1','1',0,0,'2017-12-24 20:41:39','2017-12-24 20:41:39'),('1f447f4750fc4c858b507cd3b1807502','1','1',0,0,'2017-12-24 20:29:01','2017-12-24 20:29:01'),('229891c88fe345d0a9791f6f5f8e6f1d','1','1',0,0,'2017-12-24 20:32:52','2017-12-24 20:32:52'),('29fa8d10b2fa479fb1454312a5acdca0','1','1',0,0,'2017-12-24 20:19:38','2017-12-24 20:19:38'),('2f8bc29c759c4711b8213f37da0892ed','1','1',0,0,'2017-12-24 20:16:20','2017-12-24 20:16:20'),('328053d90a654e8eb1abf1f00d3b878c','1','1',0,0,'2017-12-24 20:20:19','2017-12-24 20:20:19'),('3fdf771f273e40a8912d2e498aa6f0f1','1','1',0,0,'2017-12-24 20:35:40','2017-12-24 20:35:40'),('41e231c48b80406fb0fbe640bcc97030','1','1',0,0,'2017-12-24 20:23:36','2017-12-24 20:23:36'),('424db1dd6134472d8b5f8f43b7f89b18','1','1',0,0,'2017-12-24 20:44:10','2017-12-24 20:44:10'),('44fc8dd7856f408dbf7ec53c1a86a4d6','1','1',0,0,'2017-12-24 20:46:03','2017-12-24 20:46:03'),('494ae8ec8d5d45359d30df3d63e3bb8c','1','1',0,0,'2017-12-24 20:47:36','2017-12-24 20:47:36'),('5085f4ee0f9e4467a6178bd9d7a03d71','1','1',0,0,'2017-12-24 20:43:18','2017-12-24 20:43:18'),('50c9440a47b74e13bdd766c7cbe173e2','1','1',0,0,'2017-12-24 20:24:08','2017-12-24 20:24:08'),('637837a658ba45f48f6a47c8cb44a06c','1','1',0,0,'2017-12-24 20:38:20','2017-12-24 20:38:20'),('6c64129344e04c218072198b3782d6b5','1','1',0,0,'2017-12-24 20:18:54','2017-12-24 20:18:54'),('6ccd7409235a4855a20ad5ff0ceeeaba','1','1',0,0,'2017-12-24 20:41:00','2017-12-24 20:41:00'),('73cd3ace682a4f52ac970408c3f7cc71','1','1',0,0,'2017-12-24 20:37:17','2017-12-24 20:37:17'),('7c3fd1c4ae564f2d8015cf748eeb1204','1','1',0,0,'2017-12-24 20:21:20','2017-12-24 20:21:20'),('9771852a4f2f4c908e5e9ed2b1da5380','1','1',0,0,'2017-12-24 20:33:57','2017-12-24 20:33:57'),('97fca9fb27c341308d48fd05fb9cf6cc','1','1',0,0,'2017-12-24 20:44:51','2017-12-24 20:44:51'),('9fba454270e14aacae89957b997ba2e0','1','1',0,0,'2017-12-24 20:29:45','2017-12-24 20:29:45'),('a32b94b35850480f9fdfb6a0db258467','1','1',0,0,'2017-12-24 20:39:27','2017-12-24 20:39:27'),('a3725aa9a9374ff6b2124cdf5ae0809d','1','1',0,0,'2017-12-24 20:33:30','2017-12-24 20:33:30'),('a79b4479557e4bb9819f67e1a1647480','1','1',0,0,'2017-12-24 20:43:46','2017-12-24 20:43:46'),('a79d2fe535c64e1dbf471b03ead75828','1','1',0,0,'2017-12-24 20:18:07','2017-12-24 20:18:07'),('a869fab9b47a4e22b134cee1037b2c21','1','1',0,0,'2017-12-24 20:46:48','2017-12-24 20:46:48'),('a8e994579b4d480cb1e8a582b7b13d34','1','1',0,0,'2017-12-24 20:25:31','2017-12-24 20:25:31'),('aa7759a2eaf44704a7a1833f751eec85','1','1',0,0,'2017-12-24 20:31:56','2017-12-24 20:31:56'),('aaeed146ce6f4e2fac7dbfea6b52daa4','1','1',0,0,'2017-12-24 20:22:13','2017-12-24 20:22:13'),('af082d369eca48f4964315266b91f66a','1','1',0,0,'2017-12-24 20:27:04','2017-12-24 20:27:04'),('b08526c4babf41dbb32c09f4d256c5cd','string4444','string4444',0,0,'2017-12-26 23:04:52','2017-12-28 18:02:23'),('b3beaabd1661409f857823d2c3beef99','1','1',0,0,'2017-12-24 20:23:04','2017-12-24 20:23:04'),('b48073d97c5f438a8a08ffefaa6a7f23','1','1',0,0,'2017-12-24 20:16:56','2017-12-24 20:16:56'),('bf82dbf282f8439b9cfe5caa5794ef12','1','1',0,0,'2017-12-24 20:30:37','2017-12-24 20:30:37'),('c0b3cd4e08644681be2fd91d2222ab23','1','1',0,0,'2017-12-24 20:39:00','2017-12-24 20:39:00'),('c57b273b716e4a36b472df551d78ed14','1','1',0,0,'2017-12-24 20:17:28','2017-12-24 20:17:28'),('c5e5b5ae76284519a8a4e46a065a0572','1','1',0,0,'2017-12-24 20:21:52','2017-12-24 20:21:52'),('c86d41834b85403db5dc8df84cba6352','1','1',0,0,'2017-12-24 20:35:12','2017-12-24 20:35:12'),('ca92ef19e42545a1a39bc5e508addff7','1','1',0,0,'2017-12-24 20:32:20','2017-12-24 20:32:20'),('d0c6a67d5f06457eaf886acd2f3ed162','1','1',0,0,'2017-12-24 20:34:47','2017-12-24 20:34:47'),('d1ecabfb49e84fd4988f41b6847e02f9','1','1',0,0,'2017-12-24 20:42:12','2017-12-24 20:42:12'),('d41843ce70494e9b92a7eae46b1b70ca','1','1',0,0,'2017-12-24 20:26:29','2017-12-24 20:26:29'),('d5d65db163ee4417a23a3aafa1daeebb','1','1',0,0,'2017-12-24 20:36:29','2017-12-24 20:36:29'),('d72bad075b85470dbc41fe957a820d9f','1','1',0,0,'2017-12-24 20:22:39','2017-12-24 20:22:39'),('d78e36df05654fcfb598afc7a6e0c39f','1','1',0,0,'2017-12-24 20:42:42','2017-12-24 20:42:42'),('e1ca5b0f66d74d0faa28edec5d80c961','1','1',0,1,'2017-12-24 20:28:13','2017-12-24 20:28:13'),('e680b2a717e54f559c979a041cdf5843','1','1',0,0,'2017-12-24 20:27:41','2017-12-24 20:27:41'),('f3b82a51518d4d09ab2c41d9d708d7da','1','1',0,0,'2017-12-24 20:40:35','2017-12-24 20:40:35'),('f3de5f23bb0148f19f0fce9c60ef63c2','1','1',0,0,'2017-12-24 20:20:43','2017-12-24 20:20:43'),('fbb949cfe17f42c39829a962aacfe287','1','1',0,0,'2017-12-24 20:24:52','2017-12-24 20:24:52'),('fcf5dac9920d40dc9fd53dcc4c758bcd','1','1',0,0,'2017-12-24 20:37:54','2017-12-24 20:37:54');
>>>>>>> seperate

#
# Structure for table "manager_course"
#

DROP TABLE IF EXISTS `manager_course`;
CREATE TABLE `manager_course` (
  `manager_id` varchar(64) NOT NULL,
  `course_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`manager_id`,`course_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "manager_course"
#

<<<<<<< HEAD
INSERT INTO `manager_course` VALUES ('0d51e6a885014d34a6b0ff706a57013f','74615fae2f434219abf8753797f77a94','2017-12-24 20:47:12','2017-12-24 20:47:12',0),('1279b329377c4a688b76a6066d3af5ff','dfd8c01f7edc4bf8873d688396552e12','2017-12-24 20:40:08','2017-12-24 20:40:08',0),('19bf355e33ea471b8ed3a34e2ba08ff9','c22dc588c4e642e28b4fbf0e5266584e','2017-12-24 20:45:27','2017-12-24 20:45:27',0),('19bf40c394bb4946abf74975ca61426f','3067bec0fae449b4b475ffacd86aeb3c','2017-12-24 20:31:20','2017-12-24 20:31:20',0),('1d079b212e934ac9bb13442483eff087','dc9d54e7057c4be597feed6a66b2b729','2017-12-06 19:18:12','2017-12-06 19:18:12',0),('1e66eac6a51c4243b456e98403b4c419','ac03ee1529e34586b2b34f0a37e1f224','2017-12-24 20:41:39','2017-12-24 20:41:39',0),('1f447f4750fc4c858b507cd3b1807502','8e2abff457c84db8b4b71b44e2373a79','2017-12-24 20:29:01','2017-12-24 20:29:01',0),('2','1','2017-11-29 15:09:35','2017-11-29 15:09:35',1),('229891c88fe345d0a9791f6f5f8e6f1d','d6d267c4fff7433f974c6898f653afc6','2017-12-24 20:32:52','2017-12-24 20:32:52',0),('292856f07d7c4df4a7e09e5b10ced80a','223a742b176b4aa68dba50c49b81dd84','2017-12-06 19:22:05','2017-12-06 19:22:05',0),('29fa8d10b2fa479fb1454312a5acdca0','5dbcdabac52d4a968f791a99842c3310','2017-12-24 20:19:38','2017-12-24 20:19:38',0),('2f8bc29c759c4711b8213f37da0892ed','9be614b2aaeb41579810c4ada43988ad','2017-12-24 20:16:20','2017-12-24 20:16:20',0),('328053d90a654e8eb1abf1f00d3b878c','566e51f81efe40a2961dcbbeb31d85cf','2017-12-24 20:20:19','2017-12-24 20:20:19',0),('377b7ace22d84c7091a28f3bf6a44967','f905c98b75824c61814002e44c1ed75b','2017-12-06 19:10:20','2017-12-06 19:10:20',0),('3fdf771f273e40a8912d2e498aa6f0f1','f5f82afd1f3d421d818f5fae9ba07b68','2017-12-24 20:35:40','2017-12-24 20:35:40',0),('41e231c48b80406fb0fbe640bcc97030','6d6d1186c4494c7a93914b3754c1eaac','2017-12-24 20:23:36','2017-12-24 20:23:36',0),('424db1dd6134472d8b5f8f43b7f89b18','ed7de5d5525a437e9b234b1934f8ed89','2017-12-24 20:44:10','2017-12-24 20:44:10',0),('44fc8dd7856f408dbf7ec53c1a86a4d6','7b72db9416c640f6b61305cc6c4b772e','2017-12-24 20:46:03','2017-12-24 20:46:03',0),('494ae8ec8d5d45359d30df3d63e3bb8c','c6f694ee59fb4b08aac806682beaf36d','2017-12-24 20:47:36','2017-12-24 20:47:36',0),('5085f4ee0f9e4467a6178bd9d7a03d71','02acad2b6d7f468da1435055a2b72443','2017-12-24 20:43:18','2017-12-24 20:43:18',0),('50c9440a47b74e13bdd766c7cbe173e2','d9441495006543b28ef50163f11e5913','2017-12-24 20:24:08','2017-12-24 20:24:08',0),('637837a658ba45f48f6a47c8cb44a06c','17bfbbcd244b4f5b9a15df2b43ce87b9','2017-12-24 20:38:20','2017-12-24 20:38:20',0),('6c64129344e04c218072198b3782d6b5','de419d0bd25743f0b19ae5a97ecb45e5','2017-12-24 20:18:54','2017-12-24 20:18:54',0),('6ccd7409235a4855a20ad5ff0ceeeaba','55bb7cb3be5b44349675090f61cc56e5','2017-12-24 20:41:00','2017-12-24 20:41:00',0),('73cd3ace682a4f52ac970408c3f7cc71','2d097c854e5849648d7f9285ca72e602','2017-12-24 20:37:17','2017-12-24 20:37:17',0),('7c3fd1c4ae564f2d8015cf748eeb1204','ada5cddcb5764768bba89a1e9f49850d','2017-12-24 20:21:20','2017-12-24 20:21:20',0),('7e6ed667d5414452a6ccfeda849613ae','fccc4a78cd014b2cad09f0499e35e21c','2017-12-06 19:19:00','2017-12-06 19:19:00',0),('9771852a4f2f4c908e5e9ed2b1da5380','68be5e7ee8d64caca1727c4b00a67b9a','2017-12-24 20:33:57','2017-12-24 20:33:57',0),('97fca9fb27c341308d48fd05fb9cf6cc','c4a7b01ded644212bce6e8c39963a4f0','2017-12-24 20:44:51','2017-12-24 20:44:51',0),('9fba454270e14aacae89957b997ba2e0','a5cebe6309904802b4ed65b6bba5a985','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('a32b94b35850480f9fdfb6a0db258467','1a80be5c25a641529d4f439546c0700f','2017-12-24 20:39:27','2017-12-24 20:39:27',0),('a3725aa9a9374ff6b2124cdf5ae0809d','56d754b9edcc47dc9c98a1a49ebf9745','2017-12-24 20:33:30','2017-12-24 20:33:30',0),('a79b4479557e4bb9819f67e1a1647480','bee646f3d731496bb9a67e7684294670','2017-12-24 20:43:46','2017-12-24 20:43:46',0),('a79d2fe535c64e1dbf471b03ead75828','805396da52b3420293cae4845a0c7236','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('a869fab9b47a4e22b134cee1037b2c21','0a497b0c5ae443869938232979b03e9f','2017-12-24 20:46:48','2017-12-24 20:46:48',0),('a8e994579b4d480cb1e8a582b7b13d34','937a1b99a70e4bd9adcdafc2a87e38c9','2017-12-24 20:25:31','2017-12-24 20:25:31',0),('aa7759a2eaf44704a7a1833f751eec85','68f5f3cf5f1341469b54a97c7693e9bc','2017-12-24 20:31:56','2017-12-24 20:31:56',0),('aaeed146ce6f4e2fac7dbfea6b52daa4','4486c2dc6da44bf3ab4ca450ab22f50b','2017-12-24 20:22:13','2017-12-24 20:22:13',0),('af082d369eca48f4964315266b91f66a','458d0ee25a6f4c76ba7c66cb6f9fb684','2017-12-24 20:27:04','2017-12-24 20:27:04',0),('b3beaabd1661409f857823d2c3beef99','c4a70eeea2b94004a4d0440a3e137ebd','2017-12-24 20:23:04','2017-12-24 20:23:04',0),('b48073d97c5f438a8a08ffefaa6a7f23','1e1cb4677feb488c86ba9e1b618a6357','2017-12-24 20:16:56','2017-12-24 20:16:56',0),('bf82dbf282f8439b9cfe5caa5794ef12','d28d0d16aef24cadb666a35eb5c74f3d','2017-12-24 20:30:37','2017-12-24 20:30:37',0),('c0b3cd4e08644681be2fd91d2222ab23','f35a95424907463f93c9cecd6afec2a3','2017-12-24 20:39:00','2017-12-24 20:39:00',0),('c57b273b716e4a36b472df551d78ed14','925a54e418d240ce8c309c19df4616d6','2017-12-24 20:17:28','2017-12-24 20:17:28',0),('c5e5b5ae76284519a8a4e46a065a0572','63be3c4a046b4156a4ab68c58331ad46','2017-12-24 20:21:52','2017-12-24 20:21:52',0),('c86d41834b85403db5dc8df84cba6352','abd953040f24406493c5229abc67ed79','2017-12-24 20:35:12','2017-12-24 20:35:12',0),('ca92ef19e42545a1a39bc5e508addff7','c1722db650f54ac68029b4341281e755','2017-12-24 20:32:20','2017-12-24 20:32:20',0),('d0c6a67d5f06457eaf886acd2f3ed162','54e03bc9e2d24f90aabd13bd8d6d11dd','2017-12-24 20:34:47','2017-12-24 20:34:47',0),('d1ecabfb49e84fd4988f41b6847e02f9','63b9db88035b4433b23979dec9cde6a6','2017-12-24 20:42:12','2017-12-24 20:42:12',0),('d41843ce70494e9b92a7eae46b1b70ca','dfd1575c3b634d0cbf91f06658e1084d','2017-12-24 20:26:29','2017-12-24 20:26:29',0),('d5d65db163ee4417a23a3aafa1daeebb','38381e9deba64eb5b8803df07b5a756c','2017-12-24 20:36:29','2017-12-24 20:36:29',0),('d72bad075b85470dbc41fe957a820d9f','1ba8f61a23d64e6e939552e39602b06b','2017-12-24 20:22:39','2017-12-24 20:22:39',0),('d78e36df05654fcfb598afc7a6e0c39f','96ffabbebc3f4ec8aeeb66f3f4f39d24','2017-12-24 20:42:43','2017-12-24 20:42:43',0),('e1ca5b0f66d74d0faa28edec5d80c961','2c6e1f38838a4e74b2a742e968867c82','2017-12-24 20:28:13','2017-12-24 20:28:13',0),('e680b2a717e54f559c979a041cdf5843','96fb9435f15642328520cad703e32e67','2017-12-24 20:27:41','2017-12-24 20:27:41',0),('ea9b986c4a0e4ff4a4a9053281c7eee4','d703a9696bae4fd394647a6e50da3022','2017-11-30 14:29:15','2017-11-30 14:29:15',0),('ef8e153f9cbe4863b8b7eab3f7900533','a07274e3e90c446ea5e464df040d9c46','2017-12-06 19:17:11','2017-12-06 19:17:11',1),('f3b82a51518d4d09ab2c41d9d708d7da','80450753b02445eda613ebcfae9cfaa5','2017-12-24 20:40:35','2017-12-24 20:40:35',0),('f3de5f23bb0148f19f0fce9c60ef63c2','a8e4f84fa7044d219675f4ccc9f5c7c3','2017-12-24 20:20:43','2017-12-24 20:20:43',0),('fbb949cfe17f42c39829a962aacfe287','47a4c912bd774054afc9116490af7cf8','2017-12-24 20:24:52','2017-12-24 20:24:52',0),('fcf5dac9920d40dc9fd53dcc4c758bcd','a76d96680af840818cef65ec9b1f5893','2017-12-24 20:37:54','2017-12-24 20:37:54',0);
=======
INSERT INTO `manager_course` VALUES ('0d51e6a885014d34a6b0ff706a57013f','74615fae2f434219abf8753797f77a94','2017-12-24 20:47:12','2017-12-24 20:47:12',0),('1279b329377c4a688b76a6066d3af5ff','dfd8c01f7edc4bf8873d688396552e12','2017-12-24 20:40:08','2017-12-24 20:40:08',0),('19bf355e33ea471b8ed3a34e2ba08ff9','c22dc588c4e642e28b4fbf0e5266584e','2017-12-24 20:45:27','2017-12-24 20:45:27',0),('19bf40c394bb4946abf74975ca61426f','3067bec0fae449b4b475ffacd86aeb3c','2017-12-24 20:31:20','2017-12-24 20:31:20',0),('1e66eac6a51c4243b456e98403b4c419','ac03ee1529e34586b2b34f0a37e1f224','2017-12-24 20:41:39','2017-12-24 20:41:39',0),('1f447f4750fc4c858b507cd3b1807502','8e2abff457c84db8b4b71b44e2373a79','2017-12-24 20:29:01','2017-12-24 20:29:01',0),('229891c88fe345d0a9791f6f5f8e6f1d','d6d267c4fff7433f974c6898f653afc6','2017-12-24 20:32:52','2017-12-24 20:32:52',0),('29fa8d10b2fa479fb1454312a5acdca0','5dbcdabac52d4a968f791a99842c3310','2017-12-24 20:19:38','2017-12-24 20:19:38',0),('2f8bc29c759c4711b8213f37da0892ed','9be614b2aaeb41579810c4ada43988ad','2017-12-24 20:16:20','2017-12-24 20:16:20',0),('328053d90a654e8eb1abf1f00d3b878c','566e51f81efe40a2961dcbbeb31d85cf','2017-12-24 20:20:19','2017-12-24 20:20:19',0),('3fdf771f273e40a8912d2e498aa6f0f1','f5f82afd1f3d421d818f5fae9ba07b68','2017-12-24 20:35:40','2017-12-24 20:35:40',0),('41e231c48b80406fb0fbe640bcc97030','6d6d1186c4494c7a93914b3754c1eaac','2017-12-24 20:23:36','2017-12-24 20:23:36',0),('424db1dd6134472d8b5f8f43b7f89b18','ed7de5d5525a437e9b234b1934f8ed89','2017-12-24 20:44:10','2017-12-24 20:44:10',0),('44fc8dd7856f408dbf7ec53c1a86a4d6','7b72db9416c640f6b61305cc6c4b772e','2017-12-24 20:46:03','2017-12-24 20:46:03',0),('494ae8ec8d5d45359d30df3d63e3bb8c','c6f694ee59fb4b08aac806682beaf36d','2017-12-24 20:47:36','2017-12-24 20:47:36',0),('5085f4ee0f9e4467a6178bd9d7a03d71','02acad2b6d7f468da1435055a2b72443','2017-12-24 20:43:18','2017-12-24 20:43:18',0),('50c9440a47b74e13bdd766c7cbe173e2','d9441495006543b28ef50163f11e5913','2017-12-24 20:24:08','2017-12-24 20:24:08',0),('637837a658ba45f48f6a47c8cb44a06c','17bfbbcd244b4f5b9a15df2b43ce87b9','2017-12-24 20:38:20','2017-12-24 20:38:20',0),('6c64129344e04c218072198b3782d6b5','de419d0bd25743f0b19ae5a97ecb45e5','2017-12-24 20:18:54','2017-12-24 20:18:54',0),('6ccd7409235a4855a20ad5ff0ceeeaba','55bb7cb3be5b44349675090f61cc56e5','2017-12-24 20:41:00','2017-12-24 20:41:00',0),('73cd3ace682a4f52ac970408c3f7cc71','2d097c854e5849648d7f9285ca72e602','2017-12-24 20:37:17','2017-12-24 20:37:17',0),('7c3fd1c4ae564f2d8015cf748eeb1204','ada5cddcb5764768bba89a1e9f49850d','2017-12-24 20:21:20','2017-12-24 20:21:20',0),('7e6ed667d5414452a6ccfeda849613ae','fccc4a78cd014b2cad09f0499e35e21c','2017-12-06 19:19:00','2017-12-06 19:19:00',0),('9771852a4f2f4c908e5e9ed2b1da5380','68be5e7ee8d64caca1727c4b00a67b9a','2017-12-24 20:33:57','2017-12-24 20:33:57',0),('97fca9fb27c341308d48fd05fb9cf6cc','c4a7b01ded644212bce6e8c39963a4f0','2017-12-24 20:44:51','2017-12-24 20:44:51',0),('9fba454270e14aacae89957b997ba2e0','a5cebe6309904802b4ed65b6bba5a985','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('a32b94b35850480f9fdfb6a0db258467','1a80be5c25a641529d4f439546c0700f','2017-12-24 20:39:27','2017-12-24 20:39:27',0),('a3725aa9a9374ff6b2124cdf5ae0809d','56d754b9edcc47dc9c98a1a49ebf9745','2017-12-24 20:33:30','2017-12-24 20:33:30',0),('a79b4479557e4bb9819f67e1a1647480','bee646f3d731496bb9a67e7684294670','2017-12-24 20:43:46','2017-12-24 20:43:46',0),('a79d2fe535c64e1dbf471b03ead75828','805396da52b3420293cae4845a0c7236','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('a869fab9b47a4e22b134cee1037b2c21','0a497b0c5ae443869938232979b03e9f','2017-12-24 20:46:48','2017-12-24 20:46:48',0),('a8e994579b4d480cb1e8a582b7b13d34','937a1b99a70e4bd9adcdafc2a87e38c9','2017-12-24 20:25:31','2017-12-24 20:25:31',0),('aa7759a2eaf44704a7a1833f751eec85','68f5f3cf5f1341469b54a97c7693e9bc','2017-12-24 20:31:56','2017-12-24 20:31:56',0),('aaeed146ce6f4e2fac7dbfea6b52daa4','4486c2dc6da44bf3ab4ca450ab22f50b','2017-12-24 20:22:13','2017-12-24 20:22:13',0),('af082d369eca48f4964315266b91f66a','458d0ee25a6f4c76ba7c66cb6f9fb684','2017-12-24 20:27:04','2017-12-24 20:27:04',0),('b08526c4babf41dbb32c09f4d256c5cd','15f73a76aef8419f833cbf8edfaa5685','2017-12-26 23:04:52','2017-12-26 23:04:52',0),('b3beaabd1661409f857823d2c3beef99','c4a70eeea2b94004a4d0440a3e137ebd','2017-12-24 20:23:04','2017-12-24 20:23:04',0),('b48073d97c5f438a8a08ffefaa6a7f23','1e1cb4677feb488c86ba9e1b618a6357','2017-12-24 20:16:56','2017-12-24 20:16:56',0),('bf82dbf282f8439b9cfe5caa5794ef12','d28d0d16aef24cadb666a35eb5c74f3d','2017-12-24 20:30:37','2017-12-24 20:30:37',0),('c0b3cd4e08644681be2fd91d2222ab23','f35a95424907463f93c9cecd6afec2a3','2017-12-24 20:39:00','2017-12-24 20:39:00',0),('c57b273b716e4a36b472df551d78ed14','925a54e418d240ce8c309c19df4616d6','2017-12-24 20:17:28','2017-12-24 20:17:28',0),('c5e5b5ae76284519a8a4e46a065a0572','63be3c4a046b4156a4ab68c58331ad46','2017-12-24 20:21:52','2017-12-24 20:21:52',0),('c86d41834b85403db5dc8df84cba6352','abd953040f24406493c5229abc67ed79','2017-12-24 20:35:12','2017-12-24 20:35:12',0),('ca92ef19e42545a1a39bc5e508addff7','c1722db650f54ac68029b4341281e755','2017-12-24 20:32:20','2017-12-24 20:32:20',0),('d0c6a67d5f06457eaf886acd2f3ed162','54e03bc9e2d24f90aabd13bd8d6d11dd','2017-12-24 20:34:47','2017-12-24 20:34:47',0),('d1ecabfb49e84fd4988f41b6847e02f9','63b9db88035b4433b23979dec9cde6a6','2017-12-24 20:42:12','2017-12-24 20:42:12',0),('d41843ce70494e9b92a7eae46b1b70ca','dfd1575c3b634d0cbf91f06658e1084d','2017-12-24 20:26:29','2017-12-24 20:26:29',0),('d5d65db163ee4417a23a3aafa1daeebb','38381e9deba64eb5b8803df07b5a756c','2017-12-24 20:36:29','2017-12-24 20:36:29',0),('d72bad075b85470dbc41fe957a820d9f','1ba8f61a23d64e6e939552e39602b06b','2017-12-24 20:22:39','2017-12-24 20:22:39',0),('d78e36df05654fcfb598afc7a6e0c39f','96ffabbebc3f4ec8aeeb66f3f4f39d24','2017-12-24 20:42:43','2017-12-24 20:42:43',0),('e1ca5b0f66d74d0faa28edec5d80c961','2c6e1f38838a4e74b2a742e968867c82','2017-12-24 20:28:13','2017-12-24 20:28:13',1),('e680b2a717e54f559c979a041cdf5843','96fb9435f15642328520cad703e32e67','2017-12-24 20:27:41','2017-12-24 20:27:41',0),('f3b82a51518d4d09ab2c41d9d708d7da','80450753b02445eda613ebcfae9cfaa5','2017-12-24 20:40:35','2017-12-24 20:40:35',0),('f3de5f23bb0148f19f0fce9c60ef63c2','a8e4f84fa7044d219675f4ccc9f5c7c3','2017-12-24 20:20:43','2017-12-24 20:20:43',0),('fbb949cfe17f42c39829a962aacfe287','47a4c912bd774054afc9116490af7cf8','2017-12-24 20:24:52','2017-12-24 20:24:52',0),('fcf5dac9920d40dc9fd53dcc4c758bcd','a76d96680af840818cef65ec9b1f5893','2017-12-24 20:37:54','2017-12-24 20:37:54',0);
>>>>>>> seperate

#
# Structure for table "otherresource"
#

DROP TABLE IF EXISTS `otherresource`;
CREATE TABLE `otherresource` (
  `id` varchar(64) NOT NULL,
  `type` varchar(20) NOT NULL,
  `chinesedescription` varchar(60) DEFAULT NULL,
  `url` varchar(200) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "otherresource"
#


#
# Structure for table "picture"
#

DROP TABLE IF EXISTS `picture`;
CREATE TABLE `picture` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `description` varchar(128) NOT NULL,
  `url` varchar(128) NOT NULL,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `is_delete` tinyint(4) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=gbk;

#
# Data for table "picture"
#

INSERT INTO `picture` VALUES (1,'logo.png','http://127.0.0.1:8080/pic/7ct8pgdt2na54s3sneh5.png','2017-12-26 20:17:28',0),(2,'关联表.png','http://127.0.0.1:8080/pic/sy272xgp333smfzb8b3p.png','2017-12-26 20:59:30',0);

#
# Structure for table "ppt"
#

DROP TABLE IF EXISTS `ppt`;
CREATE TABLE `ppt` (
  `id` varchar(64) NOT NULL,
  `chinesedescription` varchar(60) DEFAULT NULL,
  `url` varchar(200) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "ppt"
#


#
# Structure for table "student"
#

DROP TABLE IF EXISTS `student`;
CREATE TABLE `student` (
  `id` varchar(64) NOT NULL,
  `account` varchar(20) NOT NULL,
  `password` varchar(64) NOT NULL,
  `name` varchar(40) NOT NULL,
  `sex` varchar(4) NOT NULL,
  `phone` varchar(30) NOT NULL,
  `class` varchar(40) NOT NULL,
  `profession` varchar(30) NOT NULL,
  `school` varchar(30) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "student"
#


#
# Structure for table "student_comment"
#

DROP TABLE IF EXISTS `student_comment`;
CREATE TABLE `student_comment` (
  `student_id` varchar(33) NOT NULL,
  `comment_id` bigint(20) NOT NULL,
  `is_delete` tinyint(4) DEFAULT '0',
  PRIMARY KEY (`student_id`,`comment_id`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

#
# Data for table "student_comment"
#


#
# Structure for table "student_course"
#

DROP TABLE IF EXISTS `student_course`;
CREATE TABLE `student_course` (
  `student_id` varchar(33) NOT NULL,
  `course_id` varchar(33) NOT NULL,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `is_delete` tinyint(4) DEFAULT '0',
  PRIMARY KEY (`student_id`,`course_id`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

#
# Data for table "student_course"
#


#
# Structure for table "student_picture"
#

DROP TABLE IF EXISTS `student_picture`;
CREATE TABLE `student_picture` (
  `student_id` varchar(64) NOT NULL,
  `picture_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`student_id`,`picture_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "student_picture"
#


#
# Structure for table "teacher"
#

DROP TABLE IF EXISTS `teacher`;
CREATE TABLE `teacher` (
  `id` varchar(64) NOT NULL,
  `number` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `sex` varchar(4) NOT NULL,
  `position` varchar(40) DEFAULT NULL,
  `personIntroduction` text,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "teacher"
#

<<<<<<< HEAD
INSERT INTO `teacher` VALUES ('039f6fa77c6b48048fa9d941f6d5e95c','T04','何建民','男','教授','','2017-12-24 20:02:02','2017-12-24 20:02:02',0),('06eb98c1cded46e3a90d8cbf1d200147','vb b','v bcn','bn','bn  ','bn ','2017-12-06 20:10:07','2017-12-06 20:10:07',0),('0ca5585c80f94896955c42bf37d552f8','T15','程浩','男','教授','','2017-12-24 20:06:57','2017-12-24 20:06:57',0),('11553bf79b5c44a5acf9966cb01850fb','T22','江兵','男','教授','','2017-12-24 20:10:53','2017-12-24 20:10:53',0),('15f6d17221004112878a22a90bda302a','T06','凌海峰','男','教授','','2017-12-24 20:03:06','2017-12-24 20:03:06',0),('17dae3df2d2a49ce97dbacaae43ffab5','T18','刘心报','男','教授','','2017-12-24 20:08:24','2017-12-24 20:08:24',0),('1873a5ba9b6f426b9b5e0d9b7e6ce39e','T16','余本功','男','教授','','2017-12-24 20:07:40','2017-12-24 20:07:40',0),('1ac2eb0c730740868ac66f06321aa0af','T08','毛雪岷','男','教授','','2017-12-24 20:04:06','2017-12-24 20:04:06',0),('1f133fd5993e477bbf7e7cbf1dc140d3','T21','孙见山','男','教授','','2017-12-24 20:10:32','2017-12-24 20:10:32',0),('1f6d8c7d89684960b064d0512bc89a51','T25','裴凤','女','教授','','2017-12-24 20:12:12','2017-12-24 20:12:12',0),('25574c94dd4a43b9a83338bbf3d5f44f','T24','周谧','男','教授','','2017-12-24 20:11:36','2017-12-24 20:11:36',0),('2caefb42a6424361a7cbb7df8c61e11f','T26','陈夏雨','女','教授','','2017-12-24 20:12:32','2017-12-24 20:12:32',0),('321a1996c424434895b93ece7ab855c5','T14','刘林','男','教授','','2017-12-24 20:06:33','2017-12-24 20:06:33',0),('408f7e1c170745fb9d052a2206146d43','T11','许君','男','教授','','2017-12-24 20:05:29','2017-12-24 20:05:29',0),('4e292a64b03f45cca5d9bde947b03295','T02','倪丽萍','女','教授','','2017-12-24 20:00:53','2017-12-24 20:00:53',0),('538927a853fb4dd5b6f217d13114170a','T27','孙春华','女','教授','','2017-12-24 20:13:41','2017-12-24 20:13:41',0),('55e954542c8247dfb02723b02b815dc4','T28','李锋刚','男','教授','','2017-12-24 20:14:21','2017-12-24 20:14:21',0),('60702dbff9874c6e8e1a98631f8b60e7','T27','王刚','男','教授','','2017-12-24 20:12:50','2017-12-24 20:12:50',0),('63306e4a88f7444d801d7f6d0f43ae86','gng','xcbxcb','xcbx','cxbx','bx','2017-12-24 18:40:39','2017-12-24 18:40:39',1),('644b84935201474fb959e7b6ae616cb2','T05','赵菊','女','教授','','2017-12-24 20:02:33','2017-12-24 20:02:33',0),('6555b97be4604fb3a20ffd2e0d911a3c','5438','zhuhanqing','st','string','string','2017-11-29 15:54:21','2017-11-29 15:54:21',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','T03','全体','男女','xx','','2017-12-24 20:01:38','2017-12-24 20:01:38',0),('68c38c713ecc4e89977e4be00c90504a','T27','许启发','男','教授','','2017-12-24 20:13:15','2017-12-24 20:13:15',0),('79e96623f593463db8a64ab147e87126','T12','倪志伟','男','教授','','2017-12-24 20:05:53','2017-12-24 20:05:53',0),('8eda7ae527fe46a3a6accafdbc2ed57f','T13','伍章俊','男','教授','','2017-12-24 20:06:09','2017-12-24 20:06:09',0),('a1f642a6461a4da585b3591147ab7607','T10','尹朋珍','女','教授','','2017-12-24 20:05:12','2017-12-24 20:05:12',0),('a9e8bb2e27cb4961af2171a805f76f25','T20','裴军','男','教授','','2017-12-24 20:10:08','2017-12-24 20:10:08',0),('ac31baa93efe4a11b8cc78675fdeeccc','XXX','佚名','待定','待定','handsome！！！','2017-12-24 19:57:48','2017-12-24 19:57:48',0),('b240547d9aa944f9bfe3de8696875062','T01','刘业政','男','正教授','组长','2017-12-24 20:00:21','2017-12-24 20:00:21',0),('b580f4172c344f65a79dacac9c0bbc61','是的GV的','第四版','地方','发的',NULL,'2017-12-06 19:50:02','2017-12-06 19:50:02',0),('bcd6e841bd55476e9588c180b0cddbce','T09','杨爱峰','女','教授','','2017-12-24 20:04:34','2017-12-24 20:04:34',0),('bf5911ed66e246999844ee4a2253b968','T17','张强','男','教授','','2017-12-24 20:07:58','2017-12-24 20:07:58',0),('c3106a52473543a58c3282871a72d952','T19','姜元春','男','教授','','2017-12-24 20:09:36','2017-12-24 20:09:36',0),('c3179ccb270f4e1881e832955c1260e1','5439','zhuhanqing2','st','string','string','2017-11-29 15:55:43','2017-11-29 15:55:43',0),('d21b2bad365f46799bfb4fa35a8702cb','T07','李应','男','教授','','2017-12-24 20:03:37','2017-12-24 20:03:37',0),('d2d2cefe43884041880b16b4a7ae8982','davds','vads','男','adv',NULL,'2017-12-06 19:49:39','2017-12-06 19:49:39',0),('de7fdb3d03b4422aae438ebd0a5b2532','T29','程八一','男','教授','','2017-12-24 20:14:42','2017-12-24 20:14:42',0),('e62c70cfeada48ef9097c409ffcab8e1','T23','方必和','男','教授','','2017-12-24 20:11:13','2017-12-24 20:11:13',0),('ea8ef4e8b0aa49ebaef0d6b845704a2c','钢化膜篡改或','消防门','修改','好','发给你反观','2017-12-06 19:52:47','2017-12-06 19:52:47',0),('ebad35f6d8654802aeaa3219a3ba35b9','5439','zhuhanqing2','st','string','string','2017-11-29 15:58:15','2017-11-29 15:58:15',0);
=======
INSERT INTO `teacher` VALUES ('039f6fa77c6b48048fa9d941f6d5e95c','T04','何建民','男','教授','\n','2017-12-24 20:02:02','2017-12-26 18:45:58',0),('0ca5585c80f94896955c42bf37d552f8','T15','程浩','男','教授','','2017-12-24 20:06:57','2017-12-24 20:06:57',0),('11553bf79b5c44a5acf9966cb01850fb','T22','江兵','男','教授','','2017-12-24 20:10:53','2017-12-24 20:10:53',0),('15f6d17221004112878a22a90bda302a','T06','凌海峰','男','教授','','2017-12-24 20:03:06','2017-12-24 20:03:06',0),('17dae3df2d2a49ce97dbacaae43ffab5','T18','刘心报','男','教授','','2017-12-24 20:08:24','2017-12-24 20:08:24',0),('1873a5ba9b6f426b9b5e0d9b7e6ce39e','T16','余本功','男','教授','','2017-12-24 20:07:40','2017-12-24 20:07:40',0),('1ac2eb0c730740868ac66f06321aa0af','T08','毛雪岷','男','教授','','2017-12-24 20:04:06','2017-12-24 20:04:06',0),('1f133fd5993e477bbf7e7cbf1dc140d3','T21','孙见山','男','教授','','2017-12-24 20:10:32','2017-12-24 20:10:32',0),('1f6d8c7d89684960b064d0512bc89a51','T25','裴凤','女','教授','','2017-12-24 20:12:12','2017-12-24 20:12:12',0),('25574c94dd4a43b9a83338bbf3d5f44f','T24','周谧','男','教授','','2017-12-24 20:11:36','2017-12-24 20:11:36',0),('2caefb42a6424361a7cbb7df8c61e11f','T26','陈夏雨','女','教授','','2017-12-24 20:12:32','2017-12-24 20:12:32',0),('3','3','3','3','3',NULL,'2017-12-24 20:12:32','2017-12-24 20:12:32',0),('321a1996c424434895b93ece7ab855c5','T14','刘林','男','教授','','2017-12-24 20:06:33','2017-12-24 20:06:33',0),('4','4','4','4','4',NULL,'2017-12-24 20:12:32','2017-12-24 20:12:32',0),('408f7e1c170745fb9d052a2206146d43','T11','许君','男','教授','','2017-12-24 20:05:29','2017-12-24 20:05:29',0),('4e292a64b03f45cca5d9bde947b03295','T02','倪丽萍','女','教授','','2017-12-24 20:00:53','2017-12-24 20:00:53',0),('538927a853fb4dd5b6f217d13114170a','T27','孙春华','女','教授','','2017-12-24 20:13:41','2017-12-24 20:13:41',0),('55e954542c8247dfb02723b02b815dc4','T28','李锋刚','男','教授','','2017-12-24 20:14:21','2017-12-24 20:14:21',0),('60702dbff9874c6e8e1a98631f8b60e7','T27','王刚','男','教授','','2017-12-24 20:12:50','2017-12-24 20:12:50',0),('644b84935201474fb959e7b6ae616cb2','T05','赵菊','女','教授','','2017-12-24 20:02:33','2017-12-24 20:02:33',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','T03','全体','男女','xx','','2017-12-24 20:01:38','2017-12-24 20:01:38',0),('68c38c713ecc4e89977e4be00c90504a','T27','许启发','男','教授','','2017-12-24 20:13:15','2017-12-24 20:13:15',0),('79e96623f593463db8a64ab147e87126','T12','倪志伟','男','教授','','2017-12-24 20:05:53','2017-12-24 20:05:53',0),('8eda7ae527fe46a3a6accafdbc2ed57f','T13','伍章俊','男','教授','','2017-12-24 20:06:09','2017-12-24 20:06:09',0),('9e1ec0aa47c34eea919bd404b4846194','1','1','s','string','string','2017-12-26 22:57:24','2017-12-26 22:57:24',0),('a1f642a6461a4da585b3591147ab7607','T10','尹朋珍','女','教授','','2017-12-24 20:05:12','2017-12-24 20:05:12',0),('a9e8bb2e27cb4961af2171a805f76f25','T20','裴军','男','教授','','2017-12-24 20:10:08','2017-12-24 20:10:08',0),('ac31baa93efe4a11b8cc78675fdeeccc','XXX','佚名','待定','待定','handsome！！！','2017-12-24 19:57:48','2017-12-24 19:57:48',0),('ac5672fe6d28436ea655c0f0de7a8810','2','2','s','string','string','2017-12-26 22:57:33','2017-12-26 22:57:33',0),('b240547d9aa944f9bfe3de8696875062','T01','刘业政','男','正教授','组长','2017-12-24 20:00:21','2017-12-26 18:52:43',0),('bcd6e841bd55476e9588c180b0cddbce','T09','杨爱峰','女','教授','','2017-12-24 20:04:34','2017-12-24 20:04:34',0),('bf5911ed66e246999844ee4a2253b968','T17','张强','男','教授','','2017-12-24 20:07:58','2017-12-24 20:07:58',0),('c3106a52473543a58c3282871a72d952','T19','姜元春','男','教授','','2017-12-24 20:09:36','2017-12-24 20:09:36',0),('d21b2bad365f46799bfb4fa35a8702cb','T07','李应','男','教授','','2017-12-24 20:03:37','2017-12-24 20:03:37',0),('de7fdb3d03b4422aae438ebd0a5b2532','T29','程八一','男','教授','','2017-12-24 20:14:42','2017-12-24 20:14:42',0),('e62c70cfeada48ef9097c409ffcab8e1','T23','方必和','男','教授','','2017-12-24 20:11:13','2017-12-24 20:11:13',0);
>>>>>>> seperate

#
# Structure for table "teacher_course"
#

DROP TABLE IF EXISTS `teacher_course`;
CREATE TABLE `teacher_course` (
  `teacher_id` varchar(64) NOT NULL,
  `course_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`teacher_id`,`course_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "teacher_course"
#

<<<<<<< HEAD
INSERT INTO `teacher_course` VALUES ('039f6fa77c6b48048fa9d941f6d5e95c','a5cebe6309904802b4ed65b6bba5a985','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('039f6fa77c6b48048fa9d941f6d5e95c','c22dc588c4e642e28b4fbf0e5266584e','2017-12-24 20:45:27','2017-12-24 20:45:27',0),('039f6fa77c6b48048fa9d941f6d5e95c','dfd1575c3b634d0cbf91f06658e1084d','2017-12-24 20:26:29','2017-12-24 20:26:29',0),('15f6d17221004112878a22a90bda302a','d6d267c4fff7433f974c6898f653afc6','2017-12-24 20:32:52','2017-12-24 20:32:52',0),('25574c94dd4a43b9a83338bbf3d5f44f','dfd8c01f7edc4bf8873d688396552e12','2017-12-24 20:40:08','2017-12-24 20:40:08',0),('4e292a64b03f45cca5d9bde947b03295','458d0ee25a6f4c76ba7c66cb6f9fb684','2017-12-24 20:27:04','2017-12-24 20:27:04',0),('644b84935201474fb959e7b6ae616cb2','3067bec0fae449b4b475ffacd86aeb3c','2017-12-24 20:31:20','2017-12-24 20:31:20',0),('644b84935201474fb959e7b6ae616cb2','68f5f3cf5f1341469b54a97c7693e9bc','2017-12-24 20:31:56','2017-12-24 20:31:56',0),('6555b97be4604fb3a20ffd2e0d911a3c','a07274e3e90c446ea5e464df040d9c46','2017-12-06 19:17:11','2017-12-06 19:17:11',1),('6555b97be4604fb3a20ffd2e0d911a3c','d703a9696bae4fd394647a6e50da3022','2017-11-30 14:29:15','2017-11-30 14:29:15',0),('6555b97be4604fb3a20ffd2e0d911a3c','f905c98b75824c61814002e44c1ed75b','2017-12-06 19:10:20','2017-12-06 19:10:20',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','02acad2b6d7f468da1435055a2b72443','2017-12-24 20:43:18','2017-12-24 20:43:18',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','0a497b0c5ae443869938232979b03e9f','2017-12-24 20:46:48','2017-12-24 20:46:48',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','1a80be5c25a641529d4f439546c0700f','2017-12-24 20:39:27','2017-12-24 20:39:27',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','2c6e1f38838a4e74b2a742e968867c82','2017-12-24 20:28:13','2017-12-24 20:28:13',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','2d097c854e5849648d7f9285ca72e602','2017-12-24 20:37:17','2017-12-24 20:37:17',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','38381e9deba64eb5b8803df07b5a756c','2017-12-24 20:36:29','2017-12-24 20:36:29',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','54e03bc9e2d24f90aabd13bd8d6d11dd','2017-12-24 20:34:47','2017-12-24 20:34:47',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','55bb7cb3be5b44349675090f61cc56e5','2017-12-24 20:41:00','2017-12-24 20:41:00',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','56d754b9edcc47dc9c98a1a49ebf9745','2017-12-24 20:33:30','2017-12-24 20:33:30',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','68be5e7ee8d64caca1727c4b00a67b9a','2017-12-24 20:33:57','2017-12-24 20:33:57',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','74615fae2f434219abf8753797f77a94','2017-12-24 20:47:12','2017-12-24 20:47:12',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','7b72db9416c640f6b61305cc6c4b772e','2017-12-24 20:46:03','2017-12-24 20:46:03',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','80450753b02445eda613ebcfae9cfaa5','2017-12-24 20:40:35','2017-12-24 20:40:35',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','937a1b99a70e4bd9adcdafc2a87e38c9','2017-12-24 20:25:31','2017-12-24 20:25:31',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','96fb9435f15642328520cad703e32e67','2017-12-24 20:27:41','2017-12-24 20:27:41',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','96ffabbebc3f4ec8aeeb66f3f4f39d24','2017-12-24 20:42:43','2017-12-24 20:42:43',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','ac03ee1529e34586b2b34f0a37e1f224','2017-12-24 20:41:39','2017-12-24 20:41:39',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','bee646f3d731496bb9a67e7684294670','2017-12-24 20:43:46','2017-12-24 20:43:46',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','c1722db650f54ac68029b4341281e755','2017-12-24 20:32:20','2017-12-24 20:32:20',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','c4a7b01ded644212bce6e8c39963a4f0','2017-12-24 20:44:51','2017-12-24 20:44:51',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','c6f694ee59fb4b08aac806682beaf36d','2017-12-24 20:47:36','2017-12-24 20:47:36',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','d28d0d16aef24cadb666a35eb5c74f3d','2017-12-24 20:30:37','2017-12-24 20:30:37',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','f35a95424907463f93c9cecd6afec2a3','2017-12-24 20:39:00','2017-12-24 20:39:00',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','f5f82afd1f3d421d818f5fae9ba07b68','2017-12-24 20:35:40','2017-12-24 20:35:40',0),('68c38c713ecc4e89977e4be00c90504a','ed7de5d5525a437e9b234b1934f8ed89','2017-12-24 20:44:10','2017-12-24 20:44:10',0),('79e96623f593463db8a64ab147e87126','8e2abff457c84db8b4b71b44e2373a79','2017-12-24 20:29:01','2017-12-24 20:29:01',0),('8eda7ae527fe46a3a6accafdbc2ed57f','17bfbbcd244b4f5b9a15df2b43ce87b9','2017-12-24 20:38:20','2017-12-24 20:38:20',0),('8eda7ae527fe46a3a6accafdbc2ed57f','a76d96680af840818cef65ec9b1f5893','2017-12-24 20:37:54','2017-12-24 20:37:54',0),('8eda7ae527fe46a3a6accafdbc2ed57f','abd953040f24406493c5229abc67ed79','2017-12-24 20:35:12','2017-12-24 20:35:12',0),('ac31baa93efe4a11b8cc78675fdeeccc','1ba8f61a23d64e6e939552e39602b06b','2017-12-24 20:22:39','2017-12-24 20:22:39',0),('ac31baa93efe4a11b8cc78675fdeeccc','1e1cb4677feb488c86ba9e1b618a6357','2017-12-24 20:16:56','2017-12-24 20:16:56',0),('ac31baa93efe4a11b8cc78675fdeeccc','4486c2dc6da44bf3ab4ca450ab22f50b','2017-12-24 20:22:13','2017-12-24 20:22:13',0),('ac31baa93efe4a11b8cc78675fdeeccc','566e51f81efe40a2961dcbbeb31d85cf','2017-12-24 20:20:19','2017-12-24 20:20:19',0),('ac31baa93efe4a11b8cc78675fdeeccc','5dbcdabac52d4a968f791a99842c3310','2017-12-24 20:19:38','2017-12-24 20:19:38',0),('ac31baa93efe4a11b8cc78675fdeeccc','63be3c4a046b4156a4ab68c58331ad46','2017-12-24 20:21:52','2017-12-24 20:21:52',0),('ac31baa93efe4a11b8cc78675fdeeccc','6d6d1186c4494c7a93914b3754c1eaac','2017-12-24 20:23:36','2017-12-24 20:23:36',0),('ac31baa93efe4a11b8cc78675fdeeccc','805396da52b3420293cae4845a0c7236','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('ac31baa93efe4a11b8cc78675fdeeccc','925a54e418d240ce8c309c19df4616d6','2017-12-24 20:17:28','2017-12-24 20:17:28',0),('ac31baa93efe4a11b8cc78675fdeeccc','9be614b2aaeb41579810c4ada43988ad','2017-12-24 20:16:20','2017-12-24 20:16:20',0),('ac31baa93efe4a11b8cc78675fdeeccc','a8e4f84fa7044d219675f4ccc9f5c7c3','2017-12-24 20:20:43','2017-12-24 20:20:43',0),('ac31baa93efe4a11b8cc78675fdeeccc','ada5cddcb5764768bba89a1e9f49850d','2017-12-24 20:21:20','2017-12-24 20:21:20',0),('ac31baa93efe4a11b8cc78675fdeeccc','c4a70eeea2b94004a4d0440a3e137ebd','2017-12-24 20:23:04','2017-12-24 20:23:04',0),('ac31baa93efe4a11b8cc78675fdeeccc','d9441495006543b28ef50163f11e5913','2017-12-24 20:24:08','2017-12-24 20:24:08',0),('ac31baa93efe4a11b8cc78675fdeeccc','de419d0bd25743f0b19ae5a97ecb45e5','2017-12-24 20:18:54','2017-12-24 20:18:54',0),('b240547d9aa944f9bfe3de8696875062','47a4c912bd774054afc9116490af7cf8','2017-12-24 20:24:52','2017-12-24 20:24:52',0),('bcd6e841bd55476e9588c180b0cddbce','63b9db88035b4433b23979dec9cde6a6','2017-12-24 20:42:12','2017-12-24 20:42:12',0),('c3179ccb270f4e1881e832955c1260e1','223a742b176b4aa68dba50c49b81dd84','2017-12-06 19:22:05','2017-12-06 19:22:05',0),('c3179ccb270f4e1881e832955c1260e1','fccc4a78cd014b2cad09f0499e35e21c','2017-12-06 19:19:00','2017-12-06 19:19:00',0),('ebad35f6d8654802aeaa3219a3ba35b9','dc9d54e7057c4be597feed6a66b2b729','2017-12-06 19:18:12','2017-12-06 19:18:12',0);
=======
INSERT INTO `teacher_course` VALUES ('039f6fa77c6b48048fa9d941f6d5e95c','a5cebe6309904802b4ed65b6bba5a985','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('039f6fa77c6b48048fa9d941f6d5e95c','c22dc588c4e642e28b4fbf0e5266584e','2017-12-24 20:45:27','2017-12-24 20:45:27',0),('039f6fa77c6b48048fa9d941f6d5e95c','dfd1575c3b634d0cbf91f06658e1084d','2017-12-24 20:26:29','2017-12-24 20:26:29',0),('15f6d17221004112878a22a90bda302a','d6d267c4fff7433f974c6898f653afc6','2017-12-24 20:32:52','2017-12-24 20:32:52',0),('25574c94dd4a43b9a83338bbf3d5f44f','dfd8c01f7edc4bf8873d688396552e12','2017-12-24 20:40:08','2017-12-24 20:40:08',0),('3','1','2017-12-24 20:29:45','2017-12-24 20:29:45',0),('3','8','2017-12-27 16:45:47','2017-12-27 16:45:47',0),('4','1','2017-12-28 19:07:08','2017-12-28 19:07:08',0),('4','8','2017-12-27 16:45:47','2017-12-27 16:45:47',0),('4e292a64b03f45cca5d9bde947b03295','458d0ee25a6f4c76ba7c66cb6f9fb684','2017-12-24 20:27:04','2017-12-24 20:27:04',0),('644b84935201474fb959e7b6ae616cb2','3067bec0fae449b4b475ffacd86aeb3c','2017-12-24 20:31:20','2017-12-24 20:31:20',0),('644b84935201474fb959e7b6ae616cb2','68f5f3cf5f1341469b54a97c7693e9bc','2017-12-24 20:31:56','2017-12-24 20:31:56',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','02acad2b6d7f468da1435055a2b72443','2017-12-24 20:43:18','2017-12-24 20:43:18',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','0a497b0c5ae443869938232979b03e9f','2017-12-24 20:46:48','2017-12-24 20:46:48',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','1a80be5c25a641529d4f439546c0700f','2017-12-24 20:39:27','2017-12-24 20:39:27',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','2c6e1f38838a4e74b2a742e968867c82','2017-12-24 20:28:13','2017-12-24 20:28:13',1),('68bf1c2b97ef4be5b58cd03aeb74dd65','2d097c854e5849648d7f9285ca72e602','2017-12-24 20:37:17','2017-12-24 20:37:17',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','38381e9deba64eb5b8803df07b5a756c','2017-12-24 20:36:29','2017-12-24 20:36:29',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','54e03bc9e2d24f90aabd13bd8d6d11dd','2017-12-24 20:34:47','2017-12-24 20:34:47',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','55bb7cb3be5b44349675090f61cc56e5','2017-12-24 20:41:00','2017-12-24 20:41:00',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','56d754b9edcc47dc9c98a1a49ebf9745','2017-12-24 20:33:30','2017-12-24 20:33:30',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','68be5e7ee8d64caca1727c4b00a67b9a','2017-12-24 20:33:57','2017-12-24 20:33:57',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','74615fae2f434219abf8753797f77a94','2017-12-24 20:47:12','2017-12-24 20:47:12',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','7b72db9416c640f6b61305cc6c4b772e','2017-12-24 20:46:03','2017-12-24 20:46:03',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','80450753b02445eda613ebcfae9cfaa5','2017-12-24 20:40:35','2017-12-24 20:40:35',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','937a1b99a70e4bd9adcdafc2a87e38c9','2017-12-24 20:25:31','2017-12-24 20:25:31',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','96fb9435f15642328520cad703e32e67','2017-12-24 20:27:41','2017-12-24 20:27:41',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','96ffabbebc3f4ec8aeeb66f3f4f39d24','2017-12-24 20:42:43','2017-12-24 20:42:43',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','ac03ee1529e34586b2b34f0a37e1f224','2017-12-24 20:41:39','2017-12-24 20:41:39',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','bee646f3d731496bb9a67e7684294670','2017-12-24 20:43:46','2017-12-24 20:43:46',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','c1722db650f54ac68029b4341281e755','2017-12-24 20:32:20','2017-12-24 20:32:20',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','c4a7b01ded644212bce6e8c39963a4f0','2017-12-24 20:44:51','2017-12-24 20:44:51',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','c6f694ee59fb4b08aac806682beaf36d','2017-12-24 20:47:36','2017-12-24 20:47:36',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','d28d0d16aef24cadb666a35eb5c74f3d','2017-12-24 20:30:37','2017-12-24 20:30:37',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','f35a95424907463f93c9cecd6afec2a3','2017-12-24 20:39:00','2017-12-24 20:39:00',0),('68bf1c2b97ef4be5b58cd03aeb74dd65','f5f82afd1f3d421d818f5fae9ba07b68','2017-12-24 20:35:40','2017-12-24 20:35:40',0),('68c38c713ecc4e89977e4be00c90504a','ed7de5d5525a437e9b234b1934f8ed89','2017-12-24 20:44:10','2017-12-24 20:44:10',0),('79e96623f593463db8a64ab147e87126','8e2abff457c84db8b4b71b44e2373a79','2017-12-24 20:29:01','2017-12-24 20:29:01',0),('8eda7ae527fe46a3a6accafdbc2ed57f','17bfbbcd244b4f5b9a15df2b43ce87b9','2017-12-24 20:38:20','2017-12-24 20:38:20',0),('8eda7ae527fe46a3a6accafdbc2ed57f','a76d96680af840818cef65ec9b1f5893','2017-12-24 20:37:54','2017-12-24 20:37:54',0),('8eda7ae527fe46a3a6accafdbc2ed57f','abd953040f24406493c5229abc67ed79','2017-12-24 20:35:12','2017-12-24 20:35:12',0),('9e1ec0aa47c34eea919bd404b4846194','15f73a76aef8419f833cbf8edfaa5685','2017-12-26 23:04:52','2017-12-26 23:04:52',1),('ac31baa93efe4a11b8cc78675fdeeccc','1ba8f61a23d64e6e939552e39602b06b','2017-12-24 20:22:39','2017-12-24 20:22:39',0),('ac31baa93efe4a11b8cc78675fdeeccc','1e1cb4677feb488c86ba9e1b618a6357','2017-12-24 20:16:56','2017-12-24 20:16:56',0),('ac31baa93efe4a11b8cc78675fdeeccc','4486c2dc6da44bf3ab4ca450ab22f50b','2017-12-24 20:22:13','2017-12-24 20:22:13',0),('ac31baa93efe4a11b8cc78675fdeeccc','566e51f81efe40a2961dcbbeb31d85cf','2017-12-24 20:20:19','2017-12-24 20:20:19',0),('ac31baa93efe4a11b8cc78675fdeeccc','5dbcdabac52d4a968f791a99842c3310','2017-12-24 20:19:38','2017-12-24 20:19:38',0),('ac31baa93efe4a11b8cc78675fdeeccc','63be3c4a046b4156a4ab68c58331ad46','2017-12-24 20:21:52','2017-12-24 20:21:52',0),('ac31baa93efe4a11b8cc78675fdeeccc','6d6d1186c4494c7a93914b3754c1eaac','2017-12-24 20:23:36','2017-12-24 20:23:36',0),('ac31baa93efe4a11b8cc78675fdeeccc','805396da52b3420293cae4845a0c7236','2017-12-24 20:18:07','2017-12-24 20:18:07',0),('ac31baa93efe4a11b8cc78675fdeeccc','925a54e418d240ce8c309c19df4616d6','2017-12-24 20:17:28','2017-12-24 20:17:28',0),('ac31baa93efe4a11b8cc78675fdeeccc','9be614b2aaeb41579810c4ada43988ad','2017-12-24 20:16:20','2017-12-24 20:16:20',0),('ac31baa93efe4a11b8cc78675fdeeccc','a8e4f84fa7044d219675f4ccc9f5c7c3','2017-12-24 20:20:43','2017-12-24 20:20:43',0),('ac31baa93efe4a11b8cc78675fdeeccc','ada5cddcb5764768bba89a1e9f49850d','2017-12-24 20:21:20','2017-12-24 20:21:20',0),('ac31baa93efe4a11b8cc78675fdeeccc','c4a70eeea2b94004a4d0440a3e137ebd','2017-12-24 20:23:04','2017-12-24 20:23:04',0),('ac31baa93efe4a11b8cc78675fdeeccc','d9441495006543b28ef50163f11e5913','2017-12-24 20:24:08','2017-12-24 20:24:08',0),('ac31baa93efe4a11b8cc78675fdeeccc','de419d0bd25743f0b19ae5a97ecb45e5','2017-12-24 20:18:54','2017-12-24 20:18:54',0),('ac5672fe6d28436ea655c0f0de7a8810','15f73a76aef8419f833cbf8edfaa5685','2017-12-26 23:04:52','2017-12-26 23:04:52',1),('b240547d9aa944f9bfe3de8696875062','47a4c912bd774054afc9116490af7cf8','2017-12-24 20:24:52','2017-12-24 20:24:52',0),('bcd6e841bd55476e9588c180b0cddbce','63b9db88035b4433b23979dec9cde6a6','2017-12-24 20:42:12','2017-12-24 20:42:12',0);
>>>>>>> seperate

#
# Structure for table "teacher_picture"
#

DROP TABLE IF EXISTS `teacher_picture`;
CREATE TABLE `teacher_picture` (
  `teacher_id` varchar(64) NOT NULL,
  `picture_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`teacher_id`,`picture_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "teacher_picture"
#


#
# Structure for table "unit"
#

DROP TABLE IF EXISTS `unit`;
CREATE TABLE `unit` (
  `id` varchar(64) NOT NULL,
  `number` varchar(9) NOT NULL,
  `name` varchar(40) NOT NULL,
  `content` text,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "unit"
#

INSERT INTO `unit` VALUES ('bcbfe8d211f24a7ca64636a34443f613','string','string','string','2017-12-13 22:47:32','2017-12-17 19:44:18',0),('e5637d3f0f9f4804bfdd0741a3b51451','aaaaaa','aaa','啊啊啊啊啊啊','2017-12-17 19:39:44','2017-12-17 19:39:44',1);

#
# Structure for table "unit_knowledgepoint"
#

DROP TABLE IF EXISTS `unit_knowledgepoint`;
CREATE TABLE `unit_knowledgepoint` (
  `unit_id` varchar(64) NOT NULL,
  `knowledgepoint_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`unit_id`,`knowledgepoint_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "unit_knowledgepoint"
#


#
# Structure for table "unit_otherresource"
#

DROP TABLE IF EXISTS `unit_otherresource`;
CREATE TABLE `unit_otherresource` (
  `unit_id` varchar(64) NOT NULL,
  `otherresource_id` varchar(64) NOT NULL,
  `createtime` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`unit_id`,`otherresource_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "unit_otherresource"
#


#
# Structure for table "unit_ppt"
#

DROP TABLE IF EXISTS `unit_ppt`;
CREATE TABLE `unit_ppt` (
  `unit_id` varchar(64) NOT NULL,
  `ppt_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`unit_id`,`ppt_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "unit_ppt"
#


#
# Structure for table "unit_video"
#

DROP TABLE IF EXISTS `unit_video`;
CREATE TABLE `unit_video` (
  `unit_id` varchar(64) NOT NULL,
  `video_id` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`unit_id`,`video_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "unit_video"
#


#
# Structure for table "video"
#

DROP TABLE IF EXISTS `video`;
CREATE TABLE `video` (
  `id` varchar(64) NOT NULL,
  `chinesedescription` varchar(60) DEFAULT NULL,
  `url` varchar(200) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updatetime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `isDelete` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "video"
#

